{
    "africa": {
        "Ancient Egypt": {
            "begin": -3100,
            "end": -1870,
            "desc": "Ancient Egypt was a civilization of ancient North Africa, concentrated along the lower reaches of the Nile River, situated in the place that is now the country Egypt. Ancient Egyptian civilization followed prehistoric Egypt and coalesced around 3100 BC (according to conventional Egyptian chronology) with the political unification of Upper and Lower Egypt under Menes (often identified with Narmer). The history of ancient Egypt occurred as a series of stable kingdoms, separated by periods of relative instability known as Intermediate Periods: the Old Kingdom of the Early Bronze Age, the Middle Kingdom of the Middle Bronze Age and the New Kingdom of the Late Bronze Age.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Ancient_Egypt"
        },
        "Bantu Migrations": {
            "begin": -3000,
            "end": -1800,
            "desc": "The Bantu expansion is a major series of migrations of the original proto-Bantu language speaking group, who spread from an original nucleus around West Africa-Central Africa across much of sub-Saharan Africa. In the process, the Proto-Bantu-speaking settlers displaced or absorbed pre-existing hunter-gatherer and pastoralist groups that they encountered.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Bantu_expansion"
        },
        "Macedonian Expansion": {
            "begin": -336,
            "end": -327,
            "desc": "Under the reign of Philip II (359–336 BC), the kingdom of Macedonia, initially at the periphery of classical Greek affairs, came to dominate Ancient Greece in the span of just 25 years, largely thanks to the personality and policies of its king. In addition to utilising effective diplomacy and marriage alliances to achieve his political aims, Philip II was also responsible for reforming the ancient Macedonian army into an effective fighting force. The Macedonian phalanx became the hallmark of the Macedonian army during his reign and the subsequent Hellenistic period. His army and engineers also made extensive use of siege engines.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Expansion_of_Macedonia_under_Philip_II"
        },
        "Roman Empire": {
            "begin": -46,
            "end": 476,
            "desc": "The Roman Empire (Latin: Imperium Rōmānum, Classical Latin: [ɪmˈpɛrɪ.ũː roːˈmaːnũː]; Koinē Greek: Βασιλεία τῶν Ῥωμαίων, romanized: Basileía tōn Rhōmaíōn) was the post-Republican period of ancient Rome, consisting of large territorial holdings around the Mediterranean Sea in Europe, North Africa and West Asia ruled by emperors. From the accession of Caesar Augustus to the military anarchy of the third century, it was a principate with Italy as metropole of the provinces and its city of Rome as sole capital (27 BC – 286 AD). Although fragmented briefly during the military crisis, the empire was forcibly reassembled, then ruled by multiple emperors who shared rule over the Western Roman Empire, based in Milan and later Ravenna, and the Eastern Roman Empire, based in Nicomedia and later Constantinople. Rome remained the nominal capital of both parts until 476 AD, when it sent the imperial insignia to Constantinople (Byzantium in Ancient Greek) following the capture of Ravenna by the barbarians of Odoacer and the subsequent deposition of Romulus Augustus. The fall of the Western Roman Empire to Germanic kings, along with the Hellenization of the Eastern Roman Empire into the Byzantine Empire, is conventionally used to mark the end of Ancient Rome and the beginning of the Middle Ages.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Roman_Empire"
        },
        "Kingdoms of Africa": {
            "begin": 500,
            "end": 1600,
            "desc": "The Sahelian kingdoms were a series of centralized kingdoms or empires that were centered on the Sahel, the area of grasslands south of the Sahara, from the 8th century to the 19th. The wealth of the states came from controlling the trade routes across the desert. Their power came from having large pack animals like camels and horses that were fast enough to keep a large empire under central control and were also useful in such kind of battle. All of these empires were also quite decentralized with member cities having a great deal of autonomy.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/African_empires#Sahelian_kingdoms"
        },
        "Abbasid Dynasty": {
            "begin": 750,
            "end": 1258,
            "desc": "The Abbasid Caliphate was the third of the Islamic caliphates to succeed the Islamic prophet Muhammad. It was founded by a dynasty descended from Muhammad's uncle, Abbas ibn Abdul-Muttalib (566–653 CE), from whom the dynasty takes its name. They ruled as caliphs for most of the caliphate from their capital in Baghdad in modern-day Iraq, after having overthrown the Umayyad Caliphate in the Abbasid Revolution of 750 CE (132 AH).",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Abbasid_Caliphate"
        },
        "Mongolian Expansion": {
            "begin": 1206,
            "end": 1227,
            "desc": "The Mongol Empire existed during the 13th and 14th centuries, and was the largest contiguous land empire in history. Originating in Mongolia, the Mongol Empire eventually stretched from Eastern Europe and parts of Central Europe to the Sea of Japan, extending northwards into parts of Siberia; eastwards and southwards into the Indian subcontinent, Mainland Southeast Asia and the Iranian Plateau; and westwards as far as the Levant and the Carpathian Mountains.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Mongol_Empire"
        },
        "European Rule": {
            "begin": 1652,
            "end": 1957,
            "desc": "The history of external colonisation of Africa can be dated from ancient, medieval, or modern history, depending on how the term colonisation is defined. In popular parlance, discussions of colonialism in Africa usually focus on the European conquests that culminated in the era of New Imperialism and the Scramble for Africa (1884-1914), followed by gradual decolonisation. The principal powers involved in the modern colonisation of Africa are Britain, France, Germany, Portugal, and Italy. In nearly all African countries today, the language used in government and media is the one imposed by a recent colonial power.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Colonisation_of_Africa"
        },
        "Movements of Freedom": {
            "begin": 1957,
            "end": 1990,
            "desc": "The African Independence Movements took place in the 20th century, when a wave of struggles for independence in European-ruled African territories were witnessed. Notable militant independence movements took place: Algeria (former French Algeria), see Algerian War, Angola (former Portuguese Angola), see Portuguese Colonial War, Guinea-Bissau (former Portuguese Guinea), see Portuguese Colonial War, Kenya (former British Kenya), see Mau Mau Uprising, Madagascar (see Malagasy Uprising) Mozambique (former Portuguese Mozambique), see Portuguese Colonial War, Namibia (former South West Africa) – against South Africa, see Namibian War of Independence and South African Border War, Zimbabwe (former Rhodesia) – see Rhodesian Bush War. For a list of African nations achieving independence, see Decolonisation of Africa.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/African_independence_movements"
        }
    },

    "asia": {
        "Yangshao Dynasty": {
            "begin": -2500,
            "end": -2200,
            "desc": "The main food of the Yangshao people was millet, with some sites using foxtail millet and others proso millet, though some evidence of rice has been found. The exact nature of Yangshao agriculture, small-scale slash-and-burn cultivation versus intensive agriculture in permanent fields, is currently a matter of debate. Once the soil was exhausted, residents picked up their belongings, moved to new lands, and constructed new villages. However, Middle Yangshao settlements such as Jiangzhi contain raised-floor buildings that may have been used for the storage of surplus grains. Grinding stones for making flour were also found.         The Yangshao people kept pigs and dogs. Sheep, goats, and cattle are found much more rarely. Much of their meat came from hunting and fishing with stone tools. Their stone tools were polished and highly specialized. They may also have practiced an early form of sericulture.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Yangshao_culture"
        },
        "Xia Dynasty": {
            "begin": -2200,
            "end": -1766,
            "desc": "The Xia dynasty is the first dynasty in traditional Chinese historiography. According to tradition, the Xia dynasty was established by the legendary Yu the Great after Shun, the last of the Five Emperors, gave his throne to him. The Xia was later succeeded by the Shang dynasty. There are no contemporaneous records of the Xia, and they are not mentioned in the oldest Chinese texts, the oracle bone inscriptions from the late Shang period (13th century BC). The earliest mentions occur in the oldest chapters of the Book of Documents, which report speeches from the early Western Zhou period, and are accepted by most scholars as dating from that time. These speeches justify the Zhou conquest of the Shang as the passing of the Mandate of Heaven, likening it to the succession of the Xia by the Shang. This political philosophy was promoted by the Confucian school in the Eastern Zhou period. The succession of dynasties was incorporated into the Bamboo Annals and the Records of the Grand Historian, and became the official position of imperial historiography and ideology. Some scholars consider the Xia dynasty mythical, or at least unsubstantiated, while others identify it with the archaeological Erlitou culture.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Xia_dynasty"
        },
        "Shang Dynasty": {
            "begin": -1766,
            "end": -1122,
            "desc": "The Shang dynasty, also historically known as the Yin dynasty (殷代; Yīndài), was a Chinese dynasty that ruled in the Lower Yellow River Valley in the second millennium BC, succeeding the semi-mythical Xia dynasty and followed by the Zhou dynasty. The classic account of the Shang comes from texts such as the Book of Documents, Bamboo Annals and Records of the Grand Historian. According to the traditional chronology based on calculations made approximately 2,000 years ago by Liu Xin, the Shang ruled from 1766 to 1122 BC, but according to the chronology based upon the 'current text' of Bamboo Annals, they ruled from 1556 to 1046 BC. The state-sponsored Xia–Shang–Zhou Chronology Project dated them from c. 1600 to 1046 BC based on the carbon 14 dates of the Erligang site.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Shang_dynasty"
        },
        "Zhou Dynasty": {
            "begin": -1122,
            "end": -256,
            "desc": "The Zhou dynasty (Chinese: 周; pinyin: Zhōu [ʈʂóu]) was a Chinese dynasty that followed the Shang dynasty and preceded the Qin dynasty. The Zhou dynasty lasted longer than any other dynasty in Chinese history (790 years). The military control of China by the royal house, surnamed Ji, lasted initially from 1046 until 771 BC for a period known as the Western Zhou and the political sphere of influence it created continued well into Eastern Zhou for another 500 years. During the Zhou dynasty, centralized power decreased throughout the Spring and Autumn period until the Warring States period in the last two centuries of the dynasty. In this period, the Zhou court had little control over its constituent states that were at war with each other until the Qin state consolidated power and formed the Qin dynasty in 221 BC. The Zhou dynasty had formally collapsed only 35 years earlier, although the dynasty had only nominal power at that point.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Zhou_dynasty"
        },
        "Warring States Period": {
            "begin": -403,
            "end": -221,
            "desc": "The Warring States period was an era in ancient Chinese history characterized by warfare, as well as bureaucratic and military reforms and consolidation. It followed the Spring and Autumn period and concluded with the Qin wars of conquest that saw the annexation of all other contender states, which ultimately led to the Qin state's victory in 221 BC as the first unified Chinese empire, known as the Qin dynasty.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Warring_States_period"
        },
        "Qin Dynasty": {
            "begin": -221,
            "end": -207,
            "desc": "The Qin dynasty was the first dynasty of Imperial China, lasting from 221 to 206 BC. Named for its heartland in Qin state (modern Gansu and Shaanxi), the dynasty was founded by Qin Shi Huang, the First Emperor of Qin. The strength of the Qin state was greatly increased by the Legalist reforms of Shang Yang in the fourth century BC, during the Warring States period. In the mid and late third century BC, the Qin state carried out a series of swift conquests, first ending the powerless Zhou dynasty, and eventually conquering the other six of the Seven Warring States. Its 15 years was the shortest major dynasty in Chinese history, consisting of only two emperors, but inaugurated an imperial system that lasted from 221 BC, with interruption and adaptation, until 1912 AD.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Qin_dynasty"
        },
        "Han Dynasty": {
            "begin": -207,
            "end": 220,
            "desc": "The Han dynasty was the second imperial dynasty of China (206 BC–220 AD), preceded by the Qin dynasty (221–206 BC) and succeeded by the Three Kingdoms period (220–280 AD). Spanning over four centuries, the Han period is considered a golden age in Chinese history. To this day, China's majority ethnic group refers to themselves as the 'Han Chinese' (Han Zu) and the Chinese script is referred to as 'Han characters'. It was founded by the rebel leader Liu Bang, known posthumously as Emperor Gaozu of Han, and briefly interrupted by the Xin dynasty (9–23 AD) of the former regent Wang Mang. This interregnum separates the Han dynasty into two periods: the Western Han or Former Han (206 BC – 9 AD) and the Eastern Han or Later Han (25–220 AD).",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Han_dynasty"
        },
        "Wei, Wu, and Shu Kingdoms": {
            "begin": 220,
            "end": 570,
            "desc": "The Three Kingdoms from 220–280 AD was the tripartite division of China among the states of Wei, Shu, and Wu. It started with the end of the Han dynasty and was followed by the Jin dynasty. The term 'Three Kingdoms' is something of a misnomer, since each state was eventually headed not by a king, but by an emperor who claimed suzerainty over all China. Nevertheless, the term 'Three Kingdoms' has become standard among English-speaking sinologists. To distinguish the three states from other historical Chinese states of the same names, historians have added a relevant character to the state's original name: the state that called itself Wei is also known as Cao Wei, the state that called itself Han is also known as Shu Han or just Shu, and the state that called itself Wu (吳) is also known as Eastern Wu or Sun Wu.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Three_Kingdoms"
        },
        "Sui Dynasty": {
            "begin": 589,
            "end": 618,
            "desc": "The Sui dynasty was a short-lived imperial dynasty of China of pivotal significance. The Sui unified the Northern and Southern dynasties and reinstalled the rule of ethnic Chinese in the entirety of China proper, along with sinicization of former nomadic ethnic minorities (Five Barbarians) within its territory. It was succeeded by the Tang dynasty, which largely inherited its foundation. Founded by Emperor Wen of Sui, the Sui dynasty capital was Chang'an (which was renamed Daxing, 581–605) and later Luoyang (605–618). Emperors Wen and Yang undertook various centralized reforms, most notably the equal-field system, intended to reduce economic inequality and improve agricultural productivity; the institution of the Three Departments and Six Ministries system; and the standardization and re-unification of the coinage. They also spread and encouraged Buddhism throughout the empire. By the middle of the dynasty, the newly unified empire entered a golden age of prosperity with vast agricultural surplus that supported rapid population growth.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Sui_dynasty"
        },
        "Tang Dynasty": {
            "begin": 618,
            "end": 907,
            "desc": "The Tang dynasty or the Tang Empire was an imperial dynasty of China that ruled from 618 to 907, with an interregnum between 690 and 705. It was preceded by the Sui dynasty and followed by the Five Dynasties and Ten Kingdoms period in Chinese history. Historians generally regard the Tang as a high point in Chinese civilization, and a golden age of cosmopolitan culture. Tang territory, acquired through the military campaigns of its early rulers, rivaled that of the Han dynasty. The Tang capital at Chang'an (present-day Xi'an) was the most populous city in the world in its day. The Lǐ family founded the dynasty, seizing power during the decline and collapse of the Sui Empire. The dynasty was briefly interrupted when Empress Wu Zetian seized the throne, proclaiming the Wu Zhou dynasty and becoming the only legitimate Chinese empress regnant. In two censuses of the 7th and 8th centuries, the Tang records estimated the population by number of registered households at about 50 million people. Yet, even when the central government was breaking down and unable to compile an accurate census of the population in the 9th century, it is estimated that the population had grown by then to about 80 million people.[10][11] With its large population base, the dynasty was able to raise professional and conscripted armies of hundreds of thousands of troops to contend with nomadic powers in dominating Inner Asia and the lucrative trade-routes along the Silk Road. Various kingdoms and states paid tribute to the Tang court, while the Tang also conquered or subdued several regions which it indirectly controlled through a protectorate system. Besides political hegemony, the Tang also exerted a powerful cultural influence over neighboring East Asian states such as those in Japan and Korea.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Tang_dynasty"
        },
        "Song Dynasty": {
            "begin": 960,
            "end": 1279,
            "desc": "The Song dynasty (Chinese: 宋朝; pinyin: Sòng cháo; 960–1279) was an imperial dynasty of China that began in 960 and lasted until 1279. The dynasty was founded by Emperor Taizu of Song following his usurpation of the throne of the Later Zhou, ending the Five Dynasties and Ten Kingdoms period. The Song often came into conflict with the contemporaneous Liao, Western Xia and Jin dynasties to its north. It was eventually conquered by the Mongol-led Yuan dynasty. The Song government was the first in world history to issue banknotes or true paper money nationally and the first Chinese government to establish a permanent standing navy. This dynasty also saw the first known use of gunpowder, as well as the first discernment of true north using a compass. The Song dynasty is divided into two distinct periods: Northern Song and Southern Song. During the Northern Song (Chinese: 北宋; 960–1127), the Song capital was in the northern city of Bianjing (now Kaifeng) and the dynasty controlled most of what is now Eastern China. The Southern Song (Chinese: 南宋; 1127–1279) refers to the period after the Song lost control of its northern half to the Jurchen-led Jin dynasty in the Jin–Song Wars. During this time, the Song court retreated south of the Yangtze and established its capital at Lin'an (now Hangzhou). Although the Song dynasty had lost control of the traditional 'birthplace of Chinese civilization' along the Yellow River, the Song economy was still strong, as the Southern Song empire contained a large population and productive agricultural land. The Southern Song dynasty considerably bolstered its naval strength to defend its waters and land borders and to conduct maritime missions abroad. To repel the Jin, and later the Mongols, the Song developed revolutionary new military technology augmented by the use of gunpowder. In 1234, the Jin dynasty was conquered by the Mongols, who took control of northern China, maintaining uneasy relations with the Southern Song. Möngke Khan, the fourth Great Khan of the Mongol Empire, died in 1259 while besieging the mountain castle Diaoyucheng, Chongqing. His younger brother Kublai Khan was proclaimed the new Great Khan, though his claim was only partially recognized by the Mongols in the west. In 1271, Kublai Khan proclaimed himself Emperor of China and established the Yuan dynasty. After two decades of sporadic warfare, Kublai Khan's armies conquered the Song dynasty in 1279, after the Southern Song suffered military defeat in the Battle of Yamen. The Mongol invasion eventually led to a Chinese reunification under the Yuan dynasty.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Song_dynasty"
        },
        "Mongolian Expansion": {
            "begin": 1206,
            "end": 1227,
            "desc": "The Mongol Empire existed during the 13th and 14th centuries, and was the largest contiguous land empire in history. Originating in Mongolia, the Mongol Empire eventually stretched from Eastern Europe and parts of Central Europe to the Sea of Japan, extending northwards into parts of Siberia; eastwards and southwards into the Indian subcontinent, Mainland Southeast Asia and the Iranian Plateau; and westwards as far as the Levant and the Carpathian Mountains.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Mongol_Empire"
        },
        "The Golden Horde": {
            "begin": 1237,
            "end": 1480,
            "desc": "The Golden Horde, Ulug Ulus (Mongolian: Алтан Орд, romanized: Altan Ord; Kazakh: Алтын Орда, Altın Orda; Tatar: Алтын Урда, Altın Urda; Russian: Золотая Орда, romanized: Zolotaya Orda) was originally a Mongol and later Turkicized khanate established in the 13th century and originating as the northwestern sector of the Mongol Empire. With the fragmentation of the Mongol Empire after 1259 it became a functionally separate khanate. It is also known as the Kipchak Khanate or as the Ulus of Jochi. After the death of Batu Khan (the founder of the Golden Horde) in 1255, his dynasty flourished for a full century, until 1359, though the intrigues of Nogai instigated a partial civil war in the late 1290s. The Horde's military power peaked during the reign of Uzbeg Khan (1312–1341), who adopted Islam. The territory of the Golden Horde at its peak included most of Eastern Europe from the Urals to the Danube River, and extended east deep into Siberia. In the south, the Golden Horde's lands bordered on the Black Sea, the Caucasus Mountains, and the territories of the Mongol dynasty known as the Ilkhanate.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Golden_Horde"
        },
        "Yuan Dynasty": {
            "begin": 1279,
            "end": 1368,
            "desc": "The Yuan dynasty, officially the Great Yuan, was the empire or ruling dynasty of China established by Kublai Khan, leader of the Mongolian Borjigin clan. It followed the Song dynasty and preceded the Ming dynasty. Although the Mongols had ruled territories including modern-day North China for decades, it was not until 1271 that Kublai Khan officially proclaimed the dynasty in the traditional Chinese style, and the conquest was not complete until 1279 when the Southern Song dynasty was defeated in the Battle of Yamen. His realm was, by this point, isolated from the other Mongol khanates and controlled most of modern-day China and its surrounding areas, including modern Mongolia. It was the first non-Han Chinese dynasty to rule all of China and lasted until 1368 when the Ming dynasty defeated the Yuan forces. Following that, the rebuked Genghisid rulers retreated to their Mongolian homeland and continued to rule as the Northern Yuan dynasty. Some of the Mongolian Emperors of the Yuan mastered the Chinese language, while others only used their native language (i.e. Mongolian) and the 'Phags-pa script.[10]",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Yuan_dynasty"
        },
        "Ming Dynasty": {
            "begin": 1368,
            "end": 1644,
            "desc": "The Ming dynasty (/mɪŋ/), officially the Great Ming, was the ruling dynasty of China from 1368 to 1644 following the collapse of the Mongol-led Yuan dynasty. The Ming dynasty was the last imperial dynasty of China ruled by Han Chinese. Although the primary capital of Beijing fell in 1644 to a rebellion led by Li Zicheng (who established the Shun dynasty, soon replaced by the Manchu-led Qing dynasty), numerous rump regimes loyal to the Ming throne – collectively called the Southern Ming – survived until 1662. The Hongwu Emperor (r. 1368–1398) attempted to create a society of self-sufficient rural communities ordered in a rigid, immobile system that would guarantee and support a permanent class of soldiers for his dynasty: the empire's standing army exceeded one million troops and the navy's dockyards in Nanjing were the largest in the world. He also took great care breaking the power of the court eunuchs and unrelated magnates, enfeoffing his many sons throughout China and attempting to guide these princes through the Huang-Ming Zuxun, a set of published dynastic instructions. This failed when his teenage successor, the Jianwen Emperor, attempted to curtail his uncles' power, prompting the Jingnan Campaign, an uprising that placed the Prince of Yan upon the throne as the Yongle Emperor in 1402. The Yongle Emperor established Yan as a secondary capital and renamed it Beijing, constructed the Forbidden City, and restored the Grand Canal and the primacy of the imperial examinations in official appointments. He rewarded his eunuch supporters and employed them as a counterweight against the Confucian scholar-bureaucrats. One, Zheng He, led seven enormous voyages of exploration into the Indian Ocean as far as Arabia and the eastern coasts of Africa.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Ming_dynasty"
        },
        "Russian Absolutism": {
            "begin": 1480,
            "end": 1917,
            "desc": "Tsarist autocracy (Russian: царское самодержавие, transcr. tsarskoye samoderzhaviye) is a form of autocracy (later absolute monarchy) specific to the Grand Duchy of Moscow, which later became Tsardom of Russia and the Russian Empire. In it, all power and wealth is controlled (and distributed) by the Tsar. They had more power than constitutional monarchs, who are usually vested by law and counterbalanced by a legislative authority; they even had more authority on religious issues compared to Western monarchs. In Russia, it originated during the time of Ivan III (1440−1505), and was abolished after the Russian Revolution of 1917.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Tsarist_autocracy"
        },
        "Qing Dynasty": {
            "begin": 1644,
            "end": 1911,
            "desc": "The Qing dynasty, officially the Great Qing ([tɕʰíŋ]), was the last imperial dynasty of China. It was established in 1636, and ruled China proper from 1644 to 1911. It was preceded by the Ming dynasty and succeeded by the Republic of China. The Qing multi-cultural empire lasted for almost three centuries and formed the territorial base for modern China. It was the fifth largest empire in world history. The dynasty was founded by the Manchu Aisin Gioro clan in Manchuria. In the late sixteenth century, Nurhaci, originally a Ming vassal, began organizing \"Banners\", military-social units that included Manchu, Han, and Mongol elements. Nurhaci united Manchu clans and officially proclaimed the Later Jin dynasty in 1616. His son Hong Taiji began driving Ming forces out of the Liaodong Peninsula and declared a new dynasty, the Qing, in 1636. As Ming control disintegrated, peasant rebels led by Li Zicheng conquered the capital, Beijing, in 1644. Ming general Wu Sangui refused to serve them, but opened the Shanhai Pass to the Banner Armies led by the regent Prince Dorgon, who defeated the rebels and seized the capital. Dorgon served as Prince Regent under the Shunzhi Emperor and implemented policies of rule. Resistance from the Ming loyalists in the south and the Revolt of the Three Feudatories led by Wu Sangui delayed complete conquest until 1683 under the Kangxi Emperor (1661–1722). The Manchu conquest of China killed over 25 million people. The Ten Great Campaigns of the Qianlong Emperor from the 1750s to the 1790s extended Qing control into Inner Asia. During the peak of the Qing dynasty, the empire ruled over the entirety of today's Mainland China, Hainan, Taiwan, Mongolia, Outer Manchuria and Outer Northwest China. The early Qing rulers maintained their Manchu customs, and while their title was Emperor, they used \"Bogd khaan\" when dealing with the Mongols and they were patrons of Tibetan Buddhism. They governed using Confucian styles and institutions of bureaucratic government and retained the imperial examinations to recruit Han Chinese to work under or in parallel with Manchus. They also adapted the ideals of the Chinese tributary system in asserting superiority over neighboring territories such as Korea. The dynasty reached its high point in the late 18th century, then gradually declined in the face of challenges from abroad, internal revolts, population growth, disruption of the economy, corruption, and the reluctance of ruling elites to change their mindsets. The population rose to some 400 million, but taxes and government revenues were fixed at a low rate, leading to fiscal crisis. Following the Opium Wars, European powers led by Great Britain imposed \"unequal treaties\", free trade, extraterritoriality and treaty ports under foreign control. The Taiping Rebellion (1850–1864) and the Dungan Revolt (1862–1877) in Central Asia led to the deaths of some 20 million people, due to famine, disease, and war. In spite of these disasters, in the Tongzhi Restoration of the 1860s, Han Chinese elites rallied to the defense of the Confucian order and the Manchu rulers. The initial gains in the Self-Strengthening Movement were lost in the First Sino-Japanese War of 1895, in which the Qing lost its influence over Korea and the possession of Taiwan. New Armies were organized, but the ambitious Hundred Days' Reform of 1898 was turned back in a coup by the conservative Empress Dowager Cixi (1835–1908), who was the dominant voice in the national government (with one interruption) after 1861. When the Scramble for Concessions by foreign powers triggered the violently anti-foreign 'Boxers' in 1900, with many foreigners and Christians killed, the foreign powers invaded China. Cixi sided with the Boxers and was decisively defeated by the eight invading powers, leading to the flight of the Imperial Court to Xi'an. After agreeing to sign the Boxer Protocol, the government initiated unprecedented fiscal and administrative reforms, including elections, a new legal code, and abolition of the examination system. Sun Yat-sen and other revolutionaries competed with constitutional monarchists such as Kang Youwei and Liang Qichao to transform the Qing Empire into a modern nation. After the deaths of Cixi and the Guangxu Emperor in 1908, the hardline Manchu court alienated reformers and local elites alike by obstructing social reform. The Wuchang Uprising on 11 October 1911, led to the Xinhai Revolution. General Yuan Shikai negotiated the abdication of Puyi, the last emperor, on 12 February 1912.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Qing_dynasty"
        },
        "Foreign Rule": {
            "begin": 1776,
            "end": 1949,
            "desc": "British Hong Kong was a colony and British Dependent Territory of the United Kingdom from 1841 to 1941 and 1945 to 1997. Hong Kong was under British rule from 1841 and was briefly occupied by Japan from 1941 to 1945 before surrendering the territory back to British forces, resuming British rule from 1945 to 1997. The colonial period began with the occupation of Hong Kong Island in 1841 during the First Opium War. The island was ceded by Qing dynasty in the aftermath of the war in 1842 and established as a Crown colony in 1843. The colony expanded to the Kowloon Peninsula in 1860 after the Second Opium War and was further extended when Britain obtained a 99-year lease of the New Territories in 1898.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/British_Hong_Kong"
        },
        "Soviet Union": {
            "begin": 1917,
            "end": 1990,
            "desc": "The Soviet Union, officially known as the Union of Soviet Socialist Republics (USSR), was a federal sovereign state in northern Eurasia that existed from 1922 to 1991.[11] Nominally a union of multiple national Soviet republics, in practice its government and economy were highly centralized. The country was a one-party state, governed by the Communist Party with Moscow as its capital in its largest republic, the Russian Soviet Federative Socialist Republic (Russian SFSR). Other major urban centers were Leningrad, Kiev, Minsk, Tashkent, Alma-Ata, and Novosibirsk. It spanned over 10,000 kilometers (6,200 mi) east to west across 11 time zones, and over 7,200 kilometers (4,500 mi) north to south. Its territory included much of Eastern Europe, as well as part of Northern Europe and all of Northern and Central Asia. It had five climate zones: tundra, taiga, steppes, desert and mountains. The Soviet Union had its roots in the 1917 October Revolution, when the Bolsheviks, led by Vladimir Lenin, overthrew the Russian Provisional Government which had replaced the autocratic regime of Tsar Nicholas II during World War I. In 1922, after a civil war ending in the Bolsheviks' victory, the USSR was formed by a treaty which united the Russian, Transcaucasian, Ukrainian and Byelorussian republics. Following Lenin's death in 1924 and a brief power struggle, Joseph Stalin came to power in the mid-1920s. Stalin formalized the Communist Party's ideology of Marxism–Leninism and replaced the market economy with a command economy which led to a period of rapid industrialization and collectivization. During this period, rapid economic development resulted in dramatic improvements in the average standard of living, particularly in urban areas.[12] Despite these improvements, significant tragedies also occurred. In addition to drought, which was a primary factor in a long history of regularly occurring famines in the region, agricultural collectivization contributed to a major famine in 1932-33, causing millions of deaths. Political paranoia fermented, especially after the rise of the Nazis in Germany in 1933, culminating in the Great Purge, during which hundreds of thousands of persons accused of spying or sabotage were arrested and executed without trial.[13]",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Soviet_Union"
        },
        "Communist China": {
            "begin": 1949,
            "end": 1990,
            "desc": "The Communist Party of China (CPC) is the founding and ruling political party of the People's Republic of China (PRC). The CPC is the sole governing party within mainland China, permitting only eight other, subordinated parties to co-exist, those making up the United Front. It was founded in 1921, chiefly by Chen Duxiu and Li Dazhao. The party grew quickly, and by 1949 it had driven the nationalist Kuomintang (KMT) government from mainland China after the Chinese Civil War, leading to the establishment of the People's Republic of China. It also controls the world's largest armed forces, the People's Liberation Army. The CPC is officially organised on the basis of democratic centralism, a principle conceived by Russian Marxist theoretician Vladimir Lenin which entails democratic and open discussion on policy on the condition of unity in upholding the agreed upon policies. The highest body of the CPC is the National Congress, convened every fifth year. When the National Congress is not in session, the Central Committee is the highest body, but since the body meets normally only once a year most duties and responsibilities are vested in the Politburo and its Standing Committee. The party's leader recently holds the offices of General Secretary (responsible for civilian party duties), Chairman of the Central Military Commission (CMC) (responsible for military affairs) and State President (a largely ceremonial position). Through these posts, the party leader is the country's paramount leader. The current paramount leader is General Secretary Xi Jinping, elected at the 18th National Congress held in October 2012. The CPC is committed to communism and continues to participate in the International Meeting of Communist and Workers' Parties each year. According to the party constitution, the CPC adheres to Marxism–Leninism, Mao Zedong Thought, socialism with Chinese characteristics, Deng Xiaoping Theory, the Three Represents, the Scientific Outlook on Development, and Xi Jinping Thought. The official explanation for China's economic reforms is that the country is in the primary stage of socialism, a developmental stage similar to the capitalist mode of production. The command economy established under Mao Zedong was replaced by the socialist market economy, the current economic system, on the basis that \"Practice is the Sole Criterion for the Truth\".",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Communist_Party_of_China"
        }
    },

    "europe": {
        "Minoan/Mycenaen Societies": {
            "begin": -2200,
            "end": -1100,
            "desc": "The Minoan civilization was a Bronze Age Aegean civilization on the island of Crete and other Aegean Islands, flourishing from c. 2700 to c. 1450 BC until a late period of decline, finally ending around 1100 BC. It represents the first advanced civilization in Europe, leaving behind massive building complexes, tools, stunning artwork, writing systems, and a massive network of trade. The civilization was rediscovered at the beginning of the 20th century through the work of British archaeologist Sir Arthur Evans. The name \"Minoan\" derives from the mythical King Minos and was coined by Evans, who identified the site at Knossos with the labyrinth and the Minotaur. The Minoan civilization has been described as the earliest of its kind in Europe, and historian Will Durant called the Minoans \"the first link in the European chain\". The Minoan civilization is particularly notable for its large and elaborate palaces up to four stories high, featuring elaborate plumbing systems and decorated with frescoes. The most notable Minoan palace is that of Knossos, followed by that of Phaistos. The Minoan period saw extensive trade between Crete, Aegean, and Mediterranean settlements, particularly the Near East. Through their traders and artists, the Minoans' cultural influence reached beyond Crete to the Cyclades, the Old Kingdom of Egypt, copper-bearing Cyprus, Canaan and the Levantine coast and Anatolia. Some of the best Minoan art is preserved in the city of Akrotiri on the island of Santorini, which was destroyed by the Minoan eruption. The Minoans primarily wrote in the undeciphered Linear A and also in undeciphered Cretan hieroglyphs, encoding a language hypothetically labelled Minoan. The reasons for the slow decline of the Minoan civilization, beginning around 1550 BC, are unclear; theories include Mycenaean invasions from mainland Greece and the major volcanic eruption of Santorini.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Minoan_civilization"
        },
        "Greek Polis socities": {
            "begin": -800,
            "end": -336,
            "desc": "Ancient Greece (Greek: Ἑλλάς, romanized: Hellás) was a civilization belonging to a period of Greek history from the Greek Dark Ages of the 12th–9th centuries BC to the end of antiquity (c. AD 600). Immediately following this period was the beginning of the Early Middle Ages and the Byzantine era. Roughly three centuries after the Late Bronze Age collapse of Mycenaean Greece, Greek urban poleis began to form in the 8th century BC, ushering in the Archaic period and colonization of the Mediterranean Basin. This was followed by the period of Classical Greece, an era that began with the Greco-Persian Wars, lasting from the 5th to 4th centuries BC. Due to the conquests by Alexander the Great of Macedon, Hellenistic civilization flourished from Central Asia to the western end of the Mediterranean Sea. The Hellenistic period came to an end with the conquests and annexations of the eastern Mediterranean world by the Roman Republic, which established the Roman province of Macedonia in Roman Greece, and later the province of Achaea during the Roman Empire. Classical Greek culture, especially philosophy, had a powerful influence on ancient Rome, which carried a version of it to many parts of the Mediterranean Basin and Europe. For this reason, Classical Greece is generally considered to be the seminal culture which provided the foundation of modern Western culture and is considered the cradle of Western civilization. Classical Greek culture gave great importance to knowledge. Science and religion were not separate and getting closer to the truth meant getting closer to the gods. In this context, they understood the importance of mathematics as an instrument for obtaining more reliable (\"divine\") knowledge. Greek culture, in a few centuries and with a limited population, managed to explore and make progress in many fields of science, mathematics, philosophy and knowledge in general.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Ancient_Greece"
        },
        "Roman Republic": {
            "begin": -509,
            "end": -46,
            "desc": "The Roman Republic (Latin: Rēs pūblica Rōmāna, Classical Latin: [ˈreːs ˈpuːblɪka roːˈmaːna]) was the era of classical Roman civilization beginning with the overthrow of the Roman Kingdom, traditionally dated to 509 BC, and ending in 27 BC with the establishment of the Roman Empire. It was during this period that Rome's control expanded from the city's immediate surroundings to hegemony over the entire Mediterranean world. Roman society under the Republic was a cultural mix of Latin, Etruscan, and Greek elements, which is especially visible in the Roman Pantheon. Its political organisation was strongly influenced by the Greek city states of Magna Graecia, with collective and annual magistracies, overseen by a senate. The top magistrates were the two consuls, who had an extensive range of executive, legislative, judicial, military, and religious powers. Whilst there were elections each year, the Republic was not a democracy, but an oligarchy, as a small number of large families (called gentes) monopolised the main magistracies. Roman institutions underwent considerable changes throughout the Republic to adapt to the difficulties it faced, such as the creation of promagistracies to rule its conquered provinces, or the composition of the senate. Unlike the Pax Romana of the Roman Empire, the Republic was in a state of quasi-perpetual war throughout its existence. Its first enemies were its Latin and Etruscan neighbours as well as the Gauls, who even sacked the city in 387 BC. The Republic nonetheless demonstrated extreme resilience and always managed to overcome its losses, however catastrophic. After the Gallic Sack, Rome conquered the whole Italian peninsula in a century, which turned the Republic into a major power in the Mediterranean. The Republic's greatest enemy was doubtless Carthage, against which it waged three wars. The Punic general Hannibal famously invaded Italy by crossing the Alps and inflicted on Rome two devastating defeats at the Lake Trasimene and Cannae, but the Republic once again recovered and won the war thanks to Scipio Africanus at the Battle of Zama in 202 BC. With Carthage defeated, Rome became the dominant power of the ancient Mediterranean world. It then embarked in a long series of difficult conquests, after having notably defeated Philip V and Perseus of Macedon, Antiochus III of the Seleucid Empire, the Lusitanian Viriathus, the Numidian Jugurtha, the great Pontic king Mithridates VI, the Gaul Vercingetorix, and the Egyptian queen Cleopatra.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Roman_Republic"
        },
        "Macedonian Expansion": {
            "begin": -336,
            "end": -327,
            "desc": "Under the reign of Philip II (359–336 BC), the kingdom of Macedonia, initially at the periphery of classical Greek affairs, came to dominate Ancient Greece in the span of just 25 years, largely thanks to the personality and policies of its king. In addition to utilising effective diplomacy and marriage alliances to achieve his political aims, Philip II was also responsible for reforming the ancient Macedonian army into an effective fighting force. The Macedonian phalanx became the hallmark of the Macedonian army during his reign and the subsequent Hellenistic period. His army and engineers also made extensive use of siege engines.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Expansion_of_Macedonia_under_Philip_II"
        },
        "Antigonid Empire": {
            "begin": -327,
            "end": -146,
            "desc": "The Antigonid dynasty was a dynasty of Hellenistic kings descended from Alexander the Great's general Antigonus I Monophthalmus (\"the One-eyed\"). Succeeding the Antipatrid dynasty in much of Macedonia, Antigonus ruled mostly over Asia Minor and northern Syria. His attempts to take control of the whole of Alexander's empire led to his defeat and death at the Battle of Ipsus in 301 BC. Antigonus's son Demetrius I Poliorcetes survived the battle, and managed to seize control of Macedon itself a few years later, but eventually lost his throne, dying as a prisoner of Seleucus I Nicator. After a period of confusion, Demetrius's son Antigonus II Gonatas was able to establish the family's control over the old Kingdom of Macedon, as well as over most of the Greek city-states, by 276 BC.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Antigonid_dynasty"
        },
        "Roman Empire": {
            "begin": -46,
            "end": 476,
            "desc": "The Roman Republic (Latin: Rēs pūblica Rōmāna, Classical Latin: [ˈreːs ˈpuːblɪka roːˈmaːna]) was the era of classical Roman civilization beginning with the overthrow of the Roman Kingdom, traditionally dated to 509 BC, and ending in 27 BC with the establishment of the Roman Empire. It was during this period that Rome's control expanded from the city's immediate surroundings to hegemony over the entire Mediterranean world. Roman society under the Republic was a cultural mix of Latin, Etruscan, and Greek elements, which is especially visible in the Roman Pantheon. Its political organisation was strongly influenced by the Greek city states of Magna Graecia, with collective and annual magistracies, overseen by a senate. The top magistrates were the two consuls, who had an extensive range of executive, legislative, judicial, military, and religious powers. Whilst there were elections each year, the Republic was not a democracy, but an oligarchy, as a small number of large families (called gentes) monopolised the main magistracies. Roman institutions underwent considerable changes throughout the Republic to adapt to the difficulties it faced, such as the creation of promagistracies to rule its conquered provinces, or the composition of the senate. Unlike the Pax Romana of the Roman Empire, the Republic was in a state of quasi-perpetual war throughout its existence. Its first enemies were its Latin and Etruscan neighbours as well as the Gauls, who even sacked the city in 387 BC. The Republic nonetheless demonstrated extreme resilience and always managed to overcome its losses, however catastrophic. After the Gallic Sack, Rome conquered the whole Italian peninsula in a century, which turned the Republic into a major power in the Mediterranean. The Republic's greatest enemy was doubtless Carthage, against which it waged three wars. The Punic general Hannibal famously invaded Italy by crossing the Alps and inflicted on Rome two devastating defeats at the Lake Trasimene and Cannae, but the Republic once again recovered and won the war thanks to Scipio Africanus at the Battle of Zama in 202 BC. With Carthage defeated, Rome became the dominant power of the ancient Mediterranean world. It then embarked in a long series of difficult conquests, after having notably defeated Philip V and Perseus of Macedon, Antiochus III of the Seleucid Empire, the Lusitanian Viriathus, the Numidian Jugurtha, the great Pontic king Mithridates VI, the Gaul Vercingetorix, and the Egyptian queen Cleopatra.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Roman_Republic"
        },
        "Byzantium": {
            "begin": 305,
            "end": 1453,
            "desc": "Byzantium was an ancient Greek colony in early antiquity that later became Constantinople, and then Istanbul. The Greek term Byzantium (or Byzantion) continued to be used as a name of Constantinople during the Byzantine Empire, even though it only referred to the empire's capital. Byzantium was colonized by the Greeks from Megara in 657 BC, and remained primarily Greek-speaking until its conquest by the Ottoman Empire in AD 1453.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Byzantium"
        },
        "European Middle Ages": {
            "begin": 476,
            "end": 1453,
            "desc": "In the history of Europe, the Middle Ages (or medieval period) lasted from the 5th to the 15th century. It began with the fall of the Western Roman Empire and merged into the Renaissance and the Age of Discovery. The Middle Ages is the middle period of the three traditional divisions of Western history: classical antiquity, the medieval period, and the modern period. The medieval period is itself subdivided into the Early, High, and Late Middle Ages. Population decline, counterurbanisation, collapse of centralized authority, invasions, and mass migrations of tribes, which had begun in Late Antiquity, continued in the Early Middle Ages. The large-scale movements of the Migration Period, including various Germanic peoples, formed new kingdoms in what remained of the Western Roman Empire. In the 7th century, North Africa and the Middle East—once part of the Byzantine Empire—came under the rule of the Umayyad Caliphate, an Islamic empire, after conquest by Muhammad's successors. Although there were substantial changes in society and political structures, the break with classical antiquity was not complete. The still-sizeable Byzantine Empire, Rome's direct continuation, survived in the Eastern Mediterranean and remained a major power. The empire's law code, the Corpus Juris Civilis or \"Code of Justinian\", was rediscovered in Northern Italy in 1070 and became widely admired later in the Middle Ages. In the West, most kingdoms incorporated the few extant Roman institutions. Monasteries were founded as campaigns to Christianise pagan Europe continued. The Franks, under the Carolingian dynasty, briefly established the Carolingian Empire during the later 8th and early 9th centuries. It covered much of Western Europe but later succumbed to the pressures of internal civil wars combined with external invasions: Vikings from the north, Magyars from the east, and Saracens from the south. During the High Middle Ages, which began after 1000, the population of Europe increased greatly as technological and agricultural innovations allowed trade to flourish and the Medieval Warm Period climate change allowed crop yields to increase. Manorialism, the organisation of peasants into villages that owed rent and labour services to the nobles, and feudalism, the political structure whereby knights and lower-status nobles owed military service to their overlords in return for the right to rent from lands and manors, were two of the ways society was organised in the High Middle Ages. The Crusades, first preached in 1095, were military attempts by Western European Christians to regain control of the Holy Land from Muslims. Kings became the heads of centralised nation-states, reducing crime and violence but making the ideal of a unified Christendom more distant. Intellectual life was marked by scholasticism, a philosophy that emphasised joining faith to reason, and by the founding of universities. The theology of Thomas Aquinas, the paintings of Giotto, the poetry of Dante and Chaucer, the travels of Marco Polo, and the Gothic architecture of cathedrals such as Chartres are among the outstanding achievements toward the end of this period and into the Late Middle Ages. The Late Middle Ages was marked by difficulties and calamities including famine, plague, and war, which significantly diminished the population of Europe; between 1347 and 1350, the Black Death killed about a third of Europeans. Controversy, heresy, and the Western Schism within the Catholic Church paralleled the interstate conflict, civil strife, and peasant revolts that occurred in the kingdoms. Cultural and technological developments transformed European society, concluding the Late Middle Ages and beginning the early modern period.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Middle_Ages"
        },
        "Rennaissance": {
            "begin": 1453,
            "end": 1500,
            "desc": "The Renaissance was a period in European history marking the transition from the Middle Ages to Modernity and covering the 15th and 16th centuries. In addition to the standard periodization, proponents of a long Renaissance put its beginning in the 14th century and its end in the 17th century. The traditional view focuses more on the early modern aspects of the Renaissance and argues that it was a break from the past, but many historians today focus more on its medieval aspects and argue that it was an extension of the Middle Ages. The intellectual basis of the Renaissance was its version of humanism, derived from the concept of Roman Humanitas and the rediscovery of classical Greek philosophy, such as that of Protagoras, who said that \"Man is the measure of all things.\" This new thinking became manifest in art, architecture, politics, science and literature. Early examples were the development of perspective in oil painting and the recycled knowledge of how to make concrete. Although the invention of metal movable type sped the dissemination of ideas from the later 15th century, the changes of the Renaissance were not uniformly experienced across Europe: the very first traces appear in Italy as early as the late 13th century, in particular with the writings of Dante and the paintings of Giotto. As a cultural movement, the Renaissance encompassed innovative flowering of Latin and vernacular literatures, beginning with the 14th-century resurgence of learning based on classical sources, which contemporaries credited to Petrarch; the development of linear perspective and other techniques of rendering a more natural reality in painting; and gradual but widespread educational reform. In politics, the Renaissance contributed to the development of the customs and conventions of diplomacy, and in science to an increased reliance on observation and inductive reasoning. Although the Renaissance saw revolutions in many intellectual pursuits, as well as social and political upheaval, it is perhaps best known for its artistic developments and the contributions of such polymaths as Leonardo da Vinci and Michelangelo, who inspired the term \"Renaissance man\". The Renaissance began in the 14th century in Florence, Italy. Various theories have been proposed to account for its origins and characteristics, focusing on a variety of factors including the social and civic peculiarities of Florence at the time: its political structure, the patronage of its dominant family, the Medici,[10] and the migration of Greek scholars and their texts to Italy following the Fall of Constantinople to the Ottoman Turks.[11][12][13] Other major centres were northern Italian city-states such as Venice, Genoa, Milan, Bologna, and finally Rome during the Renaissance Papacy.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Renaissance"
        },
        "The Golden Horde": {
            "begin": 1237,
            "end": 1480,
            "desc": "The Golden Horde, Ulug Ulus (Mongolian: Алтан Орд, romanized: Altan Ord; Kazakh: Алтын Орда, Altın Orda; Tatar: Алтын Урда, Altın Urda; Russian: Золотая Орда, romanized: Zolotaya Orda) was originally a Mongol and later Turkicized khanate established in the 13th century and originating as the northwestern sector of the Mongol Empire. With the fragmentation of the Mongol Empire after 1259 it became a functionally separate khanate. It is also known as the Kipchak Khanate or as the Ulus of Jochi. After the death of Batu Khan (the founder of the Golden Horde) in 1255, his dynasty flourished for a full century, until 1359, though the intrigues of Nogai instigated a partial civil war in the late 1290s. The Horde's military power peaked during the reign of Uzbeg Khan (1312–1341), who adopted Islam. The territory of the Golden Horde at its peak included most of Eastern Europe from the Urals to the Danube River, and extended east deep into Siberia. In the south, the Golden Horde's lands bordered on the Black Sea, the Caucasus Mountains, and the territories of the Mongol dynasty known as the Ilkhanate.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Golden_Horde"
        },
        "Mongolian Expansion": {
            "begin": 1206,
            "end": 1227,
            "desc": "The Mongol Empire existed during the 13th and 14th centuries, and was the largest contiguous land empire in history. Originating in Mongolia, the Mongol Empire eventually stretched from Eastern Europe and parts of Central Europe to the Sea of Japan, extending northwards into parts of Siberia; eastwards and southwards into the Indian subcontinent, Mainland Southeast Asia and the Iranian Plateau; and westwards as far as the Levant and the Carpathian Mountains.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Mongol_Empire"
        },
        "Russian Absolutism": {
            "begin": 1480,
            "end": 1917,
            "desc": "Tsarist autocracy (Russian: царское самодержавие, transcr. tsarskoye samoderzhaviye) is a form of autocracy (later absolute monarchy) specific to the Grand Duchy of Moscow, which later became Tsardom of Russia and the Russian Empire. In it, all power and wealth is controlled (and distributed) by the Tsar. They had more power than constitutional monarchs, who are usually vested by law and counterbalanced by a legislative authority; they even had more authority on religious issues compared to Western monarchs. In Russia, it originated during the time of Ivan III (1440−1505), and was abolished after the Russian Revolution of 1917.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Tsarist_autocracy"
        },
        "European Advances and Englightenment": {
            "begin": 1500,
            "end": 1800,
            "desc": "The Age of Enlightenment (also known as the Age of Reason or simply the Enlightenment)[note 1] was an intellectual and philosophical movement that dominated the world of ideas in Europe during the 18th century. The Enlightenment emerged out of a European intellectual and scholarly movement known as Renaissance humanism. Some consider the publication of Isaac Newton's Principia Mathematica (1687) as the first major enlightenment work. French historians traditionally date the Enlightenment from 1715 to 1789, from the death of Louis XIV of France until the outbreak of the French Revolution that ended the Ancien Regime. Most end it with the beginning of the 19th century. Philosophers and scientists of the period widely circulated their ideas through meetings at scientific academies, Masonic lodges, literary salons, coffeehouses and in printed books, journals, and pamphlets. The ideas of the Enlightenment undermined the authority of the monarchy and the Church and paved the way for the political revolutions of the 18th and 19th centuries. A variety of 19th-century movements, including liberalism and neoclassicism, trace their intellectual heritage to the Enlightenment. The Enlightenment included a range of ideas centered on the sovereignty of reason and the evidence of the senses as the primary sources of knowledge and advanced ideals such as liberty, progress, toleration, fraternity, constitutional government and separation of church and state. In France, the central doctrines of the Enlightenment philosophers were individual liberty and religious tolerance, in opposition to an absolute monarchy and the fixed dogmas of the Roman Catholic Church. The Enlightenment was marked by an emphasis on the scientific method and reductionism, along with increased questioning of religious orthodoxy—an attitude captured by Kant's essay Sapere aude (Dare to know).",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Age_of_Enlightenment"
        },
        "European Imperialization": {
            "begin": 1800,
            "end": 1914,
            "desc": "In historical contexts, New Imperialism characterizes a period of colonial expansion by European powers, the United States, and Japan during the late 19th and early 20th centuries. The period featured an unprecedented pursuit of overseas territorial acquisitions. At the time, states focused on building their empires with new technological advances and developments, expanding their territory through conquest, and exploiting the resources of the subjugated countries. During the era of New Imperialism, the Western powers (and Japan) individually conquered almost all of Africa and parts of Asia. The new wave of imperialism reflected ongoing rivalries among the great powers, the economic desire for new resources and markets, and a \"civilizing mission\" ethos. Many of the colonies established during this era gained independence during the era of decolonization that followed World War II. The qualifier \"new\" is used to differentiate modern imperialism from earlier imperial activity, such as the so-called first wave of European colonization between 1402 and 1815. In the First wave of colonization, European powers conquered and colonized the Americas and Siberia; they then later established more outposts in Africa and Asia.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/New_Imperialism"
        },
        "Soviet Union": {
            "begin": 1917,
            "end": 1990,
            "desc": "The Soviet Union, officially known as the Union of Soviet Socialist Republics (USSR), was a federal sovereign state in northern Eurasia that existed from 1922 to 1991.[11] Nominally a union of multiple national Soviet republics, in practice its government and economy were highly centralized. The country was a one-party state, governed by the Communist Party with Moscow as its capital in its largest republic, the Russian Soviet Federative Socialist Republic (Russian SFSR). Other major urban centers were Leningrad, Kiev, Minsk, Tashkent, Alma-Ata, and Novosibirsk. It spanned over 10,000 kilometers (6,200 mi) east to west across 11 time zones, and over 7,200 kilometers (4,500 mi) north to south. Its territory included much of Eastern Europe, as well as part of Northern Europe and all of Northern and Central Asia. It had five climate zones: tundra, taiga, steppes, desert and mountains. The Soviet Union had its roots in the 1917 October Revolution, when the Bolsheviks, led by Vladimir Lenin, overthrew the Russian Provisional Government which had replaced the autocratic regime of Tsar Nicholas II during World War I. In 1922, after a civil war ending in the Bolsheviks' victory, the USSR was formed by a treaty which united the Russian, Transcaucasian, Ukrainian and Byelorussian republics. Following Lenin's death in 1924 and a brief power struggle, Joseph Stalin came to power in the mid-1920s. Stalin formalized the Communist Party's ideology of Marxism–Leninism and replaced the market economy with a command economy which led to a period of rapid industrialization and collectivization. During this period, rapid economic development resulted in dramatic improvements in the average standard of living, particularly in urban areas.[12] Despite these improvements, significant tragedies also occurred. In addition to drought, which was a primary factor in a long history of regularly occurring famines in the region, agricultural collectivization contributed to a major famine in 1932-33, causing millions of deaths. Political paranoia fermented, especially after the rise of the Nazis in Germany in 1933, culminating in the Great Purge, during which hundreds of thousands of persons accused of spying or sabotage were arrested and executed without trial.[13]",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Soviet_Union"
        },
        "War and the Modern Scene": {
            "begin": 1914,
            "end": 1990,
            "desc": "World War I (often abbreviated as WWI or WW1), also known as the First World War, the Great War, the Seminal Catastrophe, and initially in North America as the European War, was a global war originating in Europe that lasted from 28 July 1914 to 11 November 1918. Contemporaneously described as \"the war to end all wars\", it led to the mobilisation of more than 70 million military personnel, including 60 million Europeans, making it one of the largest wars in history. It is also one of the deadliest conflicts in history,[10] with an estimated nine million combatants and seven million civilian deaths as a direct result of the war, while resulting genocides and the resulting 1918 influenza pandemic caused another 50 to 100 million deaths worldwide.[11] On 28 June 1914, the Austro-Hungarian heir Archduke Franz Ferdinand was assassinated in Sarajevo, leading to the July Crisis.[12][13] In response, on 23 July Austria-Hungary issued an ultimatum to Serbia. Serbia's reply failed to satisfy the Austrians, and the two moved to a war footing. A network of interlocking alliances enlarged the crisis from a bilateral issue in the Balkans to one involving most of Europe. By July 1914, the great powers of Europe were divided into two coalitions: the Triple Entente—consisting of France, Russia, and Britain—and the Triple Alliance of Germany, Austria-Hungary, and Italy (the Triple Alliance was only defensive in nature, allowing Italy to stay out of the war until April 1915, when it joined the Allied Powers after its relations with Austria-Hungary deteriorated).[14] Russia felt it necessary to back Serbia and, after Austria-Hungary shelled the Serbian capital of Belgrade on the 28 July, approved partial mobilisation.[15] Full Russian mobilisation was announced on the evening of 30 July; on the 31st, Austria-Hungary and Germany did the same, while Germany demanded Russia demobilise within twelve hours.[16] When Russia failed to comply, Germany declared war on Russia on 1 August in support of Austria-Hungary, with Austria-Hungary following suit on 6 August; France ordered full mobilisation in support of Russia on 2 August.[17]",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/World_War_I"
        }
    },

    "middle-east": {
        "Sumer": {
            "begin": -3200,
            "end": -2350,
            "desc": "Sumer (/ˈsuːmər/)[note 1] is the earliest known civilization in the historical region of southern Mesopotamia (now southern Iraq), during the Chalcolithic and Early Bronze Ages, and one of the first civilizations in the world, along with Ancient Egypt, Norte Chico and the Indus Valley. Living along the valleys of the Tigris and Euphrates, Sumerian farmers grew an abundance of grain and other crops, the surplus from which enabled them to form urban settlements. Prehistoric proto-writing dates back before 3000 BC. The earliest texts come from the cities of Uruk and Jemdet Nasr, and date to between roughly c. 3500 and c. 3000 BC.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Sumer"
        },
        "Babylon": {
            "begin": -2350,
            "end": -1600,
            "desc": "Babylon was a key kingdom in ancient Mesopotamia from the 18th to 6th centuries BC. The name-giving capital city was built on the Euphrates river and divided in equal parts along its left and right banks, with steep embankments to contain the river's seasonal floods. Babylon was originally a small Akkadian town dating from the period of the Akkadian Empire c. 2300 BCE. The town became part of a small independent city-state with the rise of the First Babylonian dynasty in the 19th century BC. After the Amorite king Hammurabi created a short-lived empire in the 18th century BC, he built Babylon up into a major city and declared himself its king, and southern Mesopotamia became known as Babylonia and Babylon eclipsed Nippur as its holy city. The empire waned under Hammurabi's son Samsu-iluna and Babylon spent long periods under Assyrian, Kassite and Elamite domination. After being destroyed and then rebuilt by the Assyrians, Babylon became the capital of the short-lived Neo-Babylonian Empire from 609 to 539 BC. The Hanging Gardens of Babylon was one of the Seven Wonders of the Ancient World, although a number of scholars believe these were actually in the Assyrian capital of Nineveh.[citation needed] After the fall of the Neo-Babylonian Empire, the city came under the rule of the Achaemenid, Seleucid, Parthian, Roman, and Sassanid empires. It has been estimated that Babylon was the largest city in the world c. 1770 – c. 1670 BC, and again c. 612 – c. 320 BC. It was perhaps the first city to reach a population above 200,000. Estimates for the maximum extent of its area range from 890 to 900 hectares (2,200 acres).",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Babylon"
        },
        "Hittite State": {
            "begin": -1450,
            "end": -1260,
            "desc": "The Hittites (/ˈhɪtaɪts/) were an Anatolian people who played an important role in establishing an empire centered on Hattusa in north-central Anatolia around 1600 BCE. This empire reached its height during the mid-14th century BCE under Suppiluliuma I, when it encompassed an area that included most of Anatolia as well as parts of the northern Levant and Upper Mesopotamia. Between the 15th and 13th centuries BCE, the Empire of Hattusa, conventionally called the Hittite Empire, came into conflict with the Egyptian Empire, Middle Assyrian Empire and the empire of the Mitanni for control of the Near East. The Assyrians eventually emerged as the dominant power and annexed much of the Hittite empire, while the remainder was sacked by Phrygian newcomers to the region. After c. 1180 BCE, during the Bronze Age collapse, the Hittites splintered into several independent \"Neo-Hittite\" city-states, some of which survived until the 8th century BCE before succumbing to the Neo-Assyrian Empire. The Hittite language was a distinct member of the Anatolian branch of the Indo-European language family, and along with the related Luwian language, is the oldest historically attested Indo-European language, referred to by its speakers as nešili \"in the language of Nesa\". The Hittites called their country the Kingdom of Hattusa (Hatti in Akkadian), a name received from the Hattians, an earlier people who inhabited the region until the beginning of the 2nd millennium BCE and spoke an unrelated language known as Hattic. The conventional name \"Hittites\" is due to their initial identification with the Biblical Hittites in 19th century archaeology. The history of the Hittite civilization is known mostly from cuneiform texts found in the area of their kingdom, and from diplomatic and commercial correspondence found in various archives in Assyria, Babylonia, Egypt and the Middle East, the decipherment of which was also a key event in the history of Indo-European linguistics. The Hittite military made successful use of chariots. The development of iron smelting was once attributed to the Hittites of Anatolia during the Late Bronze Age, with their success largely based on the advantages of a monopoly on ironworking at the time. But the view of such a \"Hittite monopoly\" has come under scrutiny and is no longer a scholarly consensus. As part of the Late-Bronze-Age/Early-Iron-Age, the Bronze Age collapse saw the slow, comparatively continuous spread of iron-working technology in the region. While there are some iron objects from Bronze Age Anatolia, the number is comparable to iron objects found in Egypt and other places during the period; and only a small number of these objects are weapons. Hittites did not use smelted iron, but rather meteorites.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Hittites"
        },
        "Assyria": {
            "begin": -1000,
            "end": -612,
            "desc": "Assyria (/əˈsɪəriə/), also called the Assyrian Empire, was a Mesopotamian kingdom and empire of the ancient Near East and the Levant that existed as a state from perhaps as early as the 25th century BC (in the form of the Assur city-state) until its collapse between 612 BC and 609 BC - spanning the periods of the Early to Middle Bronze Age through to the late Iron Age. From the end of the seventh century BC (when the Neo-Assyrian state fell) to the mid-seventh century AD, it survived as a geopolitical entity, for the most part ruled by foreign powers such as the Parthian[10] and early Sasanian Empires[11] between the mid-second century BC and late third century AD, the final part of which period saw Mesopotamia become a major centre of Syriac Christianity and the birthplace of the Church of the East.[12]  A largely Semitic-speaking realm, Assyria was centred on the Tigris in Upper Mesopotamia (modern northern Iraq, northeastern Syria, southeastern Turkey and the northwestern fringes of Iran). The Assyrians came to rule powerful empires in several periods. Making up a substantial part of the greater Mesopotamian \"cradle of civilization\", which included Sumer, the Akkadian Empire, and Babylonia, Assyria reached the height of technological, scientific and cultural achievements for its time. At its peak, the Neo-Assyrian Empire of 911 to 609 BC stretched from Cyprus and the East Mediterranean to Iran, and from present-day Armenia and Azerbaijan in the Caucasus to the Arabian Peninsula, Egypt and eastern Libya.[13]",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Assyria"
        },
        "New Babylonians": {
            "begin": -605,
            "end": -550,
            "desc": "The Neo-Babylonian Empire, also known as the Second Babylonian Empire and historically known as the Chaldean Empire, was the last of the great Mesopotamian empires to be ruled by monarchs native to Mesopotamia. Beginning with Nabopolassar's coronation as King of Babylon in 626 BC and being firmly established through the fall of the Neo-Assyrian Empire in 612 BC, the Neo-Babylonian Empire would be short-lived, being conquered after less than a century by the Persian Achaemenid Empire in 539 BC. The defeat of the Assyrians and the transfer of empire to Babylon marked the first time the city, and southern Mesopotamia in general, had risen to dominate the Ancient Near East since the collapse of Hammurabi's Old Babylonian Empire nearly a thousand years prior. The period of Neo-Babylonian rule thus saw unprecedented encomic and population growth throughout Babylonia and a renaissance of culture and artwork, with the Neo-Babylonian kings conducting massive building projects, especially in Babylon itself, and bringing back many elements from the previous two thousand or so years of Sumero-Akkadian culture. The empire retains a position within modern day cultural memory mainly due to the unflattering portrayal of Babylon and its greatest king, Nebuchadnezzar II, in the Bible, which is owed to Nebuchadnezzar's 587 BC destruction of Jerusalem and the subsequent Babylonian captivity. Babylonian sources describe Nebuchadnezzar's reign as a golden age which transformed Babylonia into the greatest empire of its time, with the king's many building projects in the empire's capital transforming the city into a city of splendor. Religious policies introduced by the Neo-Babylonian Empire's final king, Nabonidus, who favored the moon god Sîn over Babylon's patron deity Marduk, eventually provided a casus belli which allowed the Achaemenid king Cyrus the Great to invade Babylonia in 539 BC, portraying himself as a champion of Marduk divinely restoring order to the region. Babylon remained culturally distinct for centuries, with references to individuals with Babylonian names and references to the Babylonian religion being known from as late as the Parthian period in the 1st century BC. Although Babylon would revolt several times during the rule of later empires, it would never successfully restore its independence.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Neo-Babylonian_Empire"
        },
        "Achaemenid Dynasty": {
            "begin": -550,
            "end": -330,
            "desc": "The Achaemenid Empire (/əˈkiːmənɪd/; 𐎧𐏁𐏂 Xšāça  (Old Persian) \"The Empire\" c. 550–330 BC), also called the First Persian Empire,[14] was an ancient Iranian empire based in Western Asia founded by Cyrus the Great. Ranging at its greatest extent from the Balkans and Eastern Europe proper in the west to the Indus Valley in the east, it was larger than any previous empire in history, spanning 5.5[10] million square kilometers. Incorporating various peoples of different origins and faiths, it is notable for its successful model of a centralised, bureaucratic administration (through satraps under the King of Kings), for building infrastructure such as road systems and a postal system, the use of an official language across its territories, and the development of civil services and a large professional army. The empire's successes inspired similar systems in later empires.[15] By the 7th century BC, the Persians had settled in the south-western portion of the Iranian Plateau in the region of Persis, which came to be their heartland.[16] From this region, Cyrus the Great advanced to defeat the Medes, Lydia, and the Neo-Babylonian Empire, establishing the Achaemenid Empire. Alexander the Great, an avid admirer of Cyrus the Great,[17] conquered most of the empire by 330 BC.[18] Upon Alexander's death, most of the empire's former territory fell under the rule of the Ptolemaic Kingdom and Seleucid Empire, in addition to other minor territories which gained independence at that time. The Iranian elites of the central plateau reclaimed power by the second century BC under the Parthian Empire.[16] The Achaemenid Empire is noted in Western history as the antagonist of the Greek city-states during the Greco-Persian Wars and for the emancipation of the Jewish exiles in Babylon. The historical mark of the empire went far beyond its territorial and military influences and included cultural, social, technological and religious influences as well. Despite the lasting conflict between the two states, many Athenians adopted Achaemenid customs in their daily lives in a reciprocal cultural exchange,[19] some being employed by or allied to the Persian kings. The impact of Cyrus's edict is mentioned in Judeo-Christian texts, and the empire was instrumental in the spread of Zoroastrianism as far east as China. The empire also set the tone for the politics, heritage and history of Iran (also known as Persia).[20]",
            "side": 0
        },
        "Macedonian Expansion": {
            "begin": -336,
            "end": -327,
            "desc": "Under the reign of Philip II (359–336 BC), the kingdom of Macedonia, initially at the periphery of classical Greek affairs, came to dominate Ancient Greece in the span of just 25 years, largely thanks to the personality and policies of its king. In addition to utilising effective diplomacy and marriage alliances to achieve his political aims, Philip II was also responsible for reforming the ancient Macedonian army into an effective fighting force. The Macedonian phalanx became the hallmark of the Macedonian army during his reign and the subsequent Hellenistic period. His army and engineers also made extensive use of siege engines.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Expansion_of_Macedonia_under_Philip_II"
        },
        "Selucid Dynasty": {
            "begin": -328,
            "end": -83,
            "desc": "The Seleucid Empire (/sɪˈljuːsɪd/; Ancient Greek: Βασιλεία τῶν Σελευκιδῶν, Basileía tōn Seleukidōn) was a Hellenistic state ruled by the Seleucid dynasty which existed from 312 BC to 63 BC; Seleucus I Nicator founded it following the division of the Macedonian Empire vastly expanded by Alexander the Great.[10] Seleucus received Babylonia (321 BC) and from there expanded his dominions to include much of Alexander's near-eastern territories. At the height of its power, the Empire included central Anatolia, Persia, the Levant, Mesopotamia, and what is now Kuwait, Afghanistan, and parts of Pakistan and Turkmenistan. The Seleucid Empire became a major center of Hellenistic culture – it maintained the preeminence of Greek customs where a Greek political elite dominated, mostly in the urban areas.[10][11][12][13] The Greek population of the cities who formed the dominant elite were reinforced by immigration from Greece.[10][11] Seleucid attempts to defeat their old enemy Ptolemaic Egypt were frustrated by Roman demands. Having come into conflict in the east (305 BC) with Chandragupta Maurya of the Maurya Empire, Seleucus I entered into an agreement with Chandragupta whereby he ceded vast territory west of the Indus, including the Hindu Kush, modern-day Afghanistan, and the Balochistan province of Pakistan and offered his daughter in marriage to the Maurya Emperor to formalize the alliance. Antiochus III the Great attempted to project Seleucid power and authority into Hellenistic Greece, but his attempts were thwarted by the Roman Republic and by Greek allies such as the Kingdom of Pergamon, culminating in a Seleucid defeat at the 190 BC Battle of Magnesia. In the subsequent Treaty of Apamea in 188 BC, the Seleucids were compelled to pay costly war reparations and relinquished claims to territories west of the Taurus Mountains. The Parthians under Mithridates I of Parthia conquered much of the remaining eastern part of the Seleucid Empire in the mid-2nd century BC, while the independent Greco-Bactrian Kingdom continued to flourish in the northeast. However, the Seleucid kings continued to rule a rump state from Syria until the invasion by Armenian king Tigranes the Great in 83 BC and their ultimate overthrow by the Roman general Pompey in 63 BC.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Seleucid_Empire"
        },
        "Parthian Dynasty": {
            "begin": -247,
            "end": 224,
            "desc": "The Parthian Empire (/ˈpɑːrθiən/; 247 BC – 224 AD), also known as the Arsacid Empire (/ˈɑːrsəsɪd/), was a major Iranian political and cultural power in ancient Iran.[10] Its latter name comes from Arsaces I of Parthia[11] who, as leader of the Parni tribe, founded it in the mid-3rd century BC when he conquered the region of Parthia[12] in Iran's northeast, then a satrapy (province) under Andragoras, in rebellion against the Seleucid Empire. Mithridates I of Parthia (r. c. 171–138 BC) greatly expanded the empire by seizing Media and Mesopotamia from the Seleucids. At its height, the Parthian Empire stretched from the northern reaches of the Euphrates, in what is now central-eastern Turkey, to eastern Iran. The empire, located on the Silk Road trade route between the Roman Empire in the Mediterranean Basin and the Han dynasty of China, became a center of trade and commerce. The Parthians largely adopted the art, architecture, religious beliefs, and royal insignia of their culturally heterogeneous empire, which encompassed Persian, Hellenistic, and regional cultures. For about the first half of its existence, the Arsacid court adopted elements of Greek culture, though it eventually saw a gradual revival of Iranian traditions. The Arsacid rulers were titled the \"King of Kings\", as a claim to be the heirs to the Achaemenid Empire; indeed, they accepted many local kings as vassals where the Achaemenids would have had centrally appointed, albeit largely autonomous, satraps. The court did appoint a small number of satraps, largely outside Iran, but these satrapies were smaller and less powerful than the Achaemenid potentates. With the expansion of Arsacid power, the seat of central government shifted from Nisa to Ctesiphon along the Tigris (south of modern Baghdad, Iraq), although several other sites also served as capitals. The earliest enemies of the Parthians were the Seleucids in the west and the Scythians in the north. However, as Parthia expanded westward, they came into conflict with the Kingdom of Armenia, and eventually the late Roman Republic. Rome and Parthia competed with each other to establish the kings of Armenia as their subordinate clients. The Parthians soundly defeated Marcus Licinius Crassus at the Battle of Carrhae in 53 BC, and in 40–39 BC, Parthian forces captured the whole of the Levant except Tyre from the Romans. However, Mark Antony led a counterattack against Parthia, although his successes were generally achieved in his absence, under the leadership of his lieutenant Ventidius. Various Roman emperors or their appointed generals invaded Mesopotamia in the course of the ensuing Roman–Parthian Wars of the next few centuries. The Romans captured the cities of Seleucia and Ctesiphon on multiple occasions during these conflicts, but were never able to hold on to them. Frequent civil wars between Parthian contenders to the throne proved more dangerous to the Empire's stability than foreign invasion, and Parthian power evaporated when Ardashir I, ruler of Istakhr in Persis, revolted against the Arsacids and killed their last ruler, Artabanus IV, in 224 AD. Ardashir established the Sassanid Empire, which ruled Iran and much of the Near East until the Muslim conquests of the 7th century AD, although the Arsacid dynasty lived on through the Arsacid Dynasty of Armenia, the Arsacid dynasty of Iberia, and the Arsacid Dynasty of Caucasian Albania; all eponymous branches of the Parthian Arsacids.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Parthian_Empire"
        },
        "Sasanid Dynasty": {
            "begin": 224,
            "end": 651,
            "desc": "The Sasanian Empire, also called the Neo-Persian Empire by historians,[11] was the last kingdom of the Persian Empire before the rise of Islam. Named after the House of Sasan, it ruled from 224 to 651 AD.[12] The Sasanian Empire succeeded the Parthian Empire and was recognised as one of the leading world powers alongside its neighbouring arch-rival, the Roman-Byzantine Empire for a period of more than 400 years.[13][14][15] The Sasanian Empire was founded by Ardashir I, after the fall of the Parthian Empire and the defeat of the last Arsacid king, Artabanus V. At its greatest extent, the Sasanian Empire encompassed all of today's Iran, Iraq, Eastern Arabia (Bahrain, Kuwait, Oman, Qatif, Qatar, UAE), the Levant (Syria, Palestine, Lebanon, Israel, Jordan), the Caucasus (Armenia, Georgia, Republic of Azerbaijan, Dagestan), Egypt, large parts of Turkey, much of Central Asia (Afghanistan, Turkmenistan, Uzbekistan, Tajikistan), Yemen and Pakistan. According to a legend, the vexilloid of the Sasanian Empire was the Derafsh Kaviani.[16] The Sasanian Empire during Late Antiquity is considered to have been one of Iran's most important, and influential historical periods and constituted the last great Iranian empire before the Muslim conquest and the Islamization of Iran.[17] In many ways, the Sasanian period witnessed the peak of ancient Iranian civilisation. The Sasanians' cultural influence extended far beyond the empire's territorial borders, reaching as far as Western Europe,[18] Africa,[19] China and India.[20] It played a prominent role in the formation of both European and Asian medieval art.[21] Much of what later became known as Islamic culture in art, architecture, music and other subject matter was transferred from the Sasanians throughout the Muslim world.[22]",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Sasanian_Empire"
        },
        "Ummayad Dynasty": {
            "begin": 661,
            "end": 750,
            "desc": "The Umayyad Caliphate was the second of the four major caliphates established after the death of Muhammad. The caliphate was ruled by the Umayyad dynasty. The third Caliph, Uthman ibn Affan (r. 644–656), was a member of the Umayyad clan. The family established dynastic, hereditary rule with Muawiya ibn Abi Sufyan, long-time governor of Syria, who became the sixth Caliph after the end of the First Muslim Civil War in 661. After Mu'awiyah's death in 680, conflicts over the succession resulted in a Second Civil War and power eventually fell into the hands of Marwan I from another branch of the clan. Syria remained the Umayyads' main power base thereafter, and Damascus was their capital. The Umayyads continued the Muslim conquests, incorporating the Transoxiana, Sindh, the Maghreb and the Iberian Peninsula (Al-Andalus) into the Muslim world. At its greatest extent, the Umayyad Caliphate covered 11,100,000 km2 (4,300,000 sq mi) and 33 million people, making it one of the largest empires in history in both area and proportion of the world's population. The dynasty was eventually overthrown by a rebellion led by the Abbasids in 750. Survivors of the dynasty established themselves in Cordoba in the form of an Emirate and then a Caliphate, became a world centre[10] of science, medicine, philosophy and invention, ushering in the period of the Golden Age of Islam. The Umayyad caliphate ruled over a vast multiethnic and multicultural population. Christians, who still constituted a majority of the Caliphate's population, and Jews were allowed to practice their own religion but had to pay a head tax (the jizya) from which Muslims were exempt.[11] There was, however, the Muslim-only zakat tax, which was earmarked explicitly for various welfare programmes.[11][12] Prominent positions were held by Christians, some of whom belonged to families that had served in Byzantine governments. The employment of Christians was part of a broader policy of religious accommodation that was necessitated by the presence of large Christian populations in the conquered provinces, as in Syria. This policy also boosted Muawiya's popularity and solidified Syria as his power base.[13][14]",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Umayyad_Caliphate"
        },
        "Abbasid Dynasty": {
            "begin": 750,
            "end": 1258,
            "desc": "The Abbasid Caliphate was the third of the Islamic caliphates to succeed the Islamic prophet Muhammad. It was founded by a dynasty descended from Muhammad's uncle, Abbas ibn Abdul-Muttalib (566–653 CE), from whom the dynasty takes its name. They ruled as caliphs for most of the caliphate from their capital in Baghdad in modern-day Iraq, after having overthrown the Umayyad Caliphate in the Abbasid Revolution of 750 CE (132 AH).",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Abbasid_Caliphate"
        },
        "Ottoman Empire": {
            "begin": 1299,
            "end": 1923,
            "desc": "The Ottoman Empire known to the Ottomans as the Empire of Rûm/Rome[14][note 7] (Ottoman Turkish: دولت علنإه روم‎, lit. 'Exalted State of Rome'),[15] and known in Western Europe as the Turkish Empire[16] or simply Turkey,[note 8][18] was a state and caliphate that controlled much of Southeast Europe, Western Asia and North Africa between the 14th and early 20th centuries. It was founded at the end of the 13th century in northwestern Anatolia in the town of Söğüt (modern-day Bilecik Province) by the Oghuz Turkish tribal leader Osman I.[19] Although initially the dynasty was of Turkic origin, it was Persianised in terms of language, culture, literature and habits.[20][21][22][23] After 1354, the Ottomans crossed into Europe, and with the conquest of the Balkans, the Ottoman beylik was transformed into a transcontinental empire. The Ottomans ended the Byzantine Empire with the 1453 conquest of Constantinople by Mehmed the Conqueror.[24] During the 16th and 17th centuries, at the height of its power under the reign of Suleiman the Magnificent,[25] the Ottoman Empire was a multinational, multilingual empire controlling most of Southeast Europe, parts of Central Europe, Western Asia, parts of Eastern Europe and the Caucasus, North Africa and the Horn of Africa.[26] At the beginning of the 17th century, the empire contained 32 provinces and numerous vassal states. Some of these were later absorbed into the Ottoman Empire, while others were granted various types of autonomy during the course of centuries.[note 9] With Constantinople as its capital and control of lands around the Mediterranean basin, the Ottoman Empire was at the centre of interactions between the Eastern and Western worlds for six centuries. While the empire was once thought to have entered a period of decline following the death of Suleiman the Magnificent, this view is no longer supported by the majority of academic historians.[27] The empire continued to maintain a flexible and strong economy, society and military throughout the 17th and much of the 18th century.[28] However, during a long period of peace from 1740 to 1768, the Ottoman military system fell behind that of their European rivals, the Habsburg and Russian empires.[29] The Ottomans consequently suffered severe military defeats in the late 18th and early 19th centuries, which prompted them to initiate a comprehensive process of reform and modernisation known as the Tanzimat. Thus, over the course of the 19th century, the Ottoman state became vastly more powerful and organised, despite suffering further territorial losses, especially in the Balkans, where a number of new states emerged.[30] In the early 20th century the empire allied with Germany, hoping to escape from the diplomatic isolation which had contributed to its recent territorial losses, and thus joined World War I on the side of the Central Powers.[31] While the Empire was able to largely hold its own during the conflict, it was struggling with internal dissent, especially with the Arab Revolt in its Arabian holdings. During this time, genocide was committed by the Ottoman government against the Armenians, Assyrians, and Greeks.[32] The Empire's defeat and the occupation of part of its territory by the Allied Powers in the aftermath of World War I resulted in its partitioning and the loss of its Middle Eastern territories, which were divided between the United Kingdom and France. The successful Turkish War of Independence against the occupying Allies led to the emergence of the Republic of Turkey in the Anatolian heartland and the abolition of the Ottoman monarchy.[33]",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Ottoman_Empire"
        },
        "Timurid Empire": {
            "begin": 1185,
            "end": 1506,
            "desc": "The Timurid Empire was a Persianate Turco-Mongol empire comprising modern-day Uzbekistan, Iran, the southern Caucasus, Mesopotamia, Afghanistan, much of Central Asia, as well as parts of contemporary India, Pakistan, Syria and Turkey. The empire was founded by Timur (also known as Tamerlane), a warlord of Turco-Mongol lineage, who established the empire between 1370 and his death in 1405. He envisioned himself as the great restorer of the Mongol Empire of Genghis Khan and, while not descended from Genghis, regarded himself as Genghis's heir and associated much with the Borjigin. The ruling Timurid dynasty, or Timurids, lost most of Persia to the Aq Qoyunlu confederation in 1467, but members of the dynasty continued to rule smaller states, sometimes known as Timurid emirates, in Central Asia and parts of India. In the 16th century, Babur, a Timurid prince from Ferghana (modern Uzbekistan), invaded Kabulistan (modern Afghanistan) and established a small kingdom there, and from there 20 years later he invaded India to establish the Mughal Empire.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Timurid_Empire"
        },
        "Ilkhanate of Persia": {
            "begin": 1258,
            "end": 1338,
            "desc": "The Ilkhanate, also spelled Il-khanate was a khanate established from the southwestern sector of the Mongol Empire, ruled by the Mongol House of Hulagu. Hulagu Khan, the son of Tolui and grandson of Genghis Khan, inherited the Middle Eastern part of the Mongol Empire after his brother Möngke Khan died in 1260. Its core territory lies in what is now part of the countries of Iran, Azerbaijan, and Turkey. At its greatest extent, the Ilkhanate also included parts of modern Iraq, Armenia, Georgia, Turkmenistan, Afghanistan, part of modern Dagestan, part of modern Tajikistan, and the northwestern edge of the Indian subcontinent. Later Ilkhanate rulers, beginning with Ghazan in 1295, converted to Islam. In the 1330s, the Ilkhanate was ravaged by the Black Death. Its last khan Abu Sa'id died in 1335, after which the khanate disintegrated.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Ilkhanate"
        },
        "Assorted States": {
            "begin": 1506,
            "end": 1990,
            "desc": "The Middle East is a transcontinental region which includes Western Asia (although generally excluding the Caucasus), and all of Turkey (including its European part) and Egypt (which is mostly in North Africa). The term has come into wider usage as a replacement of the term Near East (as opposed to the Far East) beginning in the early 20th century. The broader concept of the \"Greater Middle East\" (or Middle East and North Africa) also adds the Maghreb, Sudan, Djibouti, Somalia, Afghanistan, Pakistan, and sometimes even Central Asia and Transcaucasia into the region. The term \"Middle East\" has led to some confusion over its changing definitions. Most Middle Eastern countries (13 out of 18) are part of the Arab world. The history of the Middle East dates back to ancient times, with the geopolitical importance of the region being recognized for millennia. Several major religions have their origins in the Middle East, including Judaism, Christianity, and Islam. Arabs constitute the majority ethnic group in the region, followed by Turks, Persians, Kurds, Azeris, Copts, Jews, Assyrians, Iraqi Turkmen, and Greek Cypriots.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Middle_East"
        }
    },

    "southeast-asia": {
        "Harrapan Society": {
            "begin": -2000,
            "end": -1500,
            "desc": "Harappa (Punjabi pronunciation: [ɦəɽəppaː]; Urdu/Punjabi: ہڑپّہ) is an archaeological site in Punjab, Pakistan, about 24 km (15 mi) west of Sahiwal. The site takes its name from a modern village located near the former course of the Ravi River which now runs 8 km (5.0 mi) to the north. The current village of Harappa is less than 1 km (0.62 mi) from the ancient site. Although modern Harappa has a legacy railway station from the British Raj period, it is a small crossroads town of 15,000 people today. The site of the ancient city contains the ruins of a Bronze Age fortified city, which was part of the Indus Valley Civilization centred in Sindh and the Punjab, and then the Cemetery H culture. The city is believed to have had as many as 23,500 residents and occupied about 150 hectares (370 acres) with clay brick houses at its greatest extent during the Mature Harappan phase (2600 BC – 1900 BC), which is considered large for its time. Per archaeological convention of naming a previously unknown civilization by its first excavated site, the Indus Valley Civilization is also called the Harappan Civilization. The ancient city of Harappa was heavily damaged under British rule, when bricks from the ruins were used as track ballast in the construction of the Lahore–Multan Railway. In 2005, a controversial amusement park scheme at the site was abandoned when builders unearthed many archaeological artifacts during the early stages of building work. A plea from the Pakistani archaeologist Mohit Prem Kumar to the Ministry of Culture resulted in a restoration of the site.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Harappa"
        },
        "Vedic Age": {
            "begin": -1500,
            "end": -500,
            "desc": "The Vedic period or Vedic age (c. 1500 – c. 500 BCE), is the period in the history of the northern Indian subcontinent between the end of the urban Indus Valley Civilisation and a second urbanisation which began in the central Indo-Gangetic Plain c. 600 BCE. It gets its name from the Vedas, which are liturgical texts containing details of life during this period that have been interpreted to be historical and constitute the primary sources for understanding the period. These documents, alongside the corresponding archaeological record, allow for the evolution of the Vedic culture to be traced and inferred. The Vedas were composed and orally transmitted with precision by speakers of an Old Indo-Aryan language who had migrated into the northwestern regions of the Indian subcontinent early in this period. The Vedic society was patriarchal and patrilineal. Early Vedic Aryans were a Late Bronze Age society centred in the Punjab, organised into tribes rather than kingdoms, and primarily sustained by a pastoral way of life. Around c. 1200–1000 BCE, Vedic Aryans spread eastward to the fertile western Ganges Plain and adopted iron tools which allowed for clearing of forest and the adoption of a more settled, agricultural way of life. The second half of the Vedic period was characterised by the emergence of towns, kingdoms, and a complex social differentiation distinctive to India, and the Kuru Kingdom's codification of orthodox sacrificial ritual. During this time, the central Ganges Plain was dominated by a related but non-Vedic Indo-Aryan culture. The end of the Vedic period witnessed the rise of true cities and large states (called mahajanapadas) as well as śramaṇa movements (including Jainism and Buddhism) which challenged the Vedic orthodoxy. The Vedic period saw the emergence of a hierarchy of social classes that would remain influential. Vedic religion developed into Brahmanical orthodoxy, and around the beginning of the Common Era, the Vedic tradition formed one of the main constituents of \"Hindu synthesis\".",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Vedic_period"
        },
        "Macedonian Expansion": {
            "begin": -336,
            "end": -327,
            "desc": "Under the reign of Philip II (359–336 BC), the kingdom of Macedonia, initially at the periphery of classical Greek affairs, came to dominate Ancient Greece in the span of just 25 years, largely thanks to the personality and policies of its king. In addition to utilising effective diplomacy and marriage alliances to achieve his political aims, Philip II was also responsible for reforming the ancient Macedonian army into an effective fighting force. The Macedonian phalanx became the hallmark of the Macedonian army during his reign and the subsequent Hellenistic period. His army and engineers also made extensive use of siege engines.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Expansion_of_Macedonia_under_Philip_II"
        },
        "Mauryan Dynasty": {
            "begin": -321,
            "end": -185,
            "desc": "The Maurya Empire was a geographically extensive Iron Age historical power based in Magadha and founded by Chandragupta Maurya which dominated the Indian subcontinent between 322 and 185 BCE. Comprising the majority of South Asia, the Maurya Empire was centralized by the conquest of the Indo-Gangetic Plain, and its capital city was located at Pataliputra (modern Patna). The empire was the largest political entity that has ever existed in the Indian subcontinent, extending over 5 million square kilometres (1.9 million square miles) at its zenith under Ashoka. Chandragupta Maurya raised an army, with the assistance of Chanakya (also known as Kauṭilya), and overthrew the Nanda Empire in c. 322 BCE. Chandragupta rapidly expanded his power westwards across central and western India by conquering the satraps left by Alexander the Great, and by 317 BCE the empire had fully occupied northwestern India.[10] The Mauryan Empire then defeated Seleucus I, a diadochus and founder of the Seleucid Empire during the Seleucid–Mauryan war, thus acquiring territory west of the Indus River.[11][12] At its greatest extent, the empire stretched along the natural boundary of the Himalayas, to the east into Assam, to the west into Balochistan (southwest Pakistan and southeast Iran) and the Hindu Kush mountains of what is now eastern Afghanistan.[13] The dynasty expanded into India's southern regions[14][15] by the reign of the emperors Pushkar and Bindusara, but it excluded Kalinga (modern Odisha), until it was conquered by Ashoka.[16] It declined for about 50 years after Ashoka's rule, and dissolved in 185 BCE with the foundation of the Shunga dynasty in Magadha. Under Chandragupta Maurya and his successors, internal and external trade, agriculture, and economic activities all thrived and expanded across South Asia due to the creation of a single and efficient system of finance, administration, and security. The Maurya dynasty built the Grand Trunk Road, one of Asia's oldest and longest trade networks, connecting the Indian subcontinent with Central Asia.[17] After the Kalinga War, the Empire experienced nearly half a century of centralized rule under Ashoka. Chandragupta Maurya's embrace of Jainism increased socio-religious reform across South Asia, while Ashoka's embrace of Buddhism and sponsorship of Buddhist missionaries allowed for the expansion of that faith into Sri Lanka, northwest India, Central Asia, Southeast Asia, Egypt, and Hellenistic Europe.[18] The population of the empire has been estimated to be about 50–60 million, making the Mauryan Empire one of the most populous empires of antiquity.[19][20] Archaeologically, the period of Mauryan rule in South Asia falls into the era of Northern Black Polished Ware (NBPW). The Arthashastra[21] and the Edicts of Ashoka are the primary sources of written records of Mauryan times. The Lion Capital of Ashoka at Sarnath is the national emblem of the modern Republic of India.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Maurya_Empire"
        },
        "Bactrian Rule": {
            "begin": -182,
            "end": 1,
            "desc": "Bactria (Bactrian: βαχλο, Bakhlo) (/ˈbæktriə/), or Bactriana, was an ancient Iranian region in Central Asia. Bactria proper was north of the Hindu Kush mountain range and south of the Amu Darya river, covering the flat region that straddles modern-day Afghanistan, Tajikistan and Uzbekistan. More broadly Bactria was the area north of the Hindu Kush, west of the Pamirs and south of the Tian Shan, with the Amu Darya flowing west through the center. Called \"beautiful Bactria, crowned with flags\" by the Avesta, the region is one of the sixteen perfect Iranian lands that the supreme deity Ahura Mazda had created. One of the early centers of Zoroastrianism and capital of the legendary Kayanian kings of Iran, Bactria is mentioned in the Behistun Inscription of Darius the Great as one of the satrapies of the Achaemenid Empire; it was a special satrapy and was ruled by a crown prince or an intended heir. Bactria was center of Iranian resistance against the Macedonian invaders after fall of the Achaemenid Empire in the 4th century BC, but eventually fell to Alexander the Great. After death of the Macedonian conqueror, Bactria was annexed by his general, Seleucus I. Nevertheless, the Seleucids lost the region after declaration of independence by the satrap of Bactria, Diodotus I; thus started history of the Greco-Bactrian and the later Indo-Greek Kingdoms. By the 2nd century BC, Bactria was conquered by the nomadic Sakas, and in the early 1st century, the Kushan Empire was formed by the Iranian, or Tocharian Yuezhi in the Bactrian territories. Shapur I, the second Sasanian King of Kings of Iran, conquered western parts of the Kushan Empire in the 3rd century, and the Kushano-Sasanian Kingdom was formed. The Sasanians lost Bactria in the 4th century, however, it was reconquered in the 6th century. With the Muslim conquest of Iran in the 7th century, Islamization of Bactria began. Bactria was center of an Iranian Renaissance in the 8th and 9th centuries, and New Persian as an independent literary language first emerged in this region. The Samanid Empire was formed in Eastern Iran by the descendants Saman Khuda, a Persian from Bactria; thus started spread of Persian language in the region and decline of Bactrian language. Bactrian, an Eastern Iranian language, was the common language of Bactria and surroundings areas in ancient and early medieval times. Zoroastrianism and Buddhism were the religions of the majority of Bactrians before the rise of Islam.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Bactria"
        },
        "Kushan Empire": {
            "begin": 1,
            "end": 300,
            "desc": "The Kushan Empire (Ancient Greek: Βασιλεία Κοσσανῶν; Bactrian: Κυϸανο, Kushano; Sanskrit: Gupta allahabad ku.jpg Gupta gujarat ssaa.jpg Gupta ashoka nn.svg Ku-shā-ṇa (Late Brahmi script), Kuṣāṇa Sāmrājya; BHS: Guṣāṇa-vaṃśa; Chinese: 貴霜; Parthian: Kušan-xšaθr[15]) was a syncretic empire, formed by the Yuezhi, in the Bactrian territories in the early 1st century. It spread to encompass much of Afghanistan,[16] and then the northern parts of the Indian subcontinent at least as far as Saketa and Sarnath near Varanasi (Benares), where inscriptions have been found dating to the era of the Kushan Emperor Kanishka the Great.[17] Emperor Kanishka was a great patron of Buddhism. He played an important role in the establishment of Buddhism in the Indian subcontinent and its spread to Central Asia and China. The Kushans were one of five branches of the Yuezhi confederation,[18][19] a possibly Iranian[20][21] or Tocharian,[22][23][24][25][26][27] Indo-European[26][28][29][30] nomadic people who migrated from Gansu and settled in ancient Bactria.[19] The Kushans possibly used the Greek language initially for administrative purposes, but soon began to use Bactrian language. Kanishka sent his armies north of the Karakoram mountains. A direct road from Gandhara to China remained under Kushan control for more than a century, encouraging travel across the Karakoram and facilitating the spread of Mahayana Buddhism to China. The Kushan dynasty had diplomatic contacts with the Roman Empire, Sasanian Persia, the Aksumite Empire and the Han dynasty of China. The Kushan Empire was at the center of trade relations between the Roman Empire and China: according to Alain Daniélou, \"for a time, the Kushana Empire was the centerpoint of the major civilizations\".[31] While much philosophy, art, and science was created within its borders, the only textual record of the empire's history today comes from inscriptions and accounts in other languages, particularly Chinese.[32] The Kushan empire fragmented into semi-independent kingdoms in the 3rd century AD, which fell to the Sasanians invading from the west, establishing the Kushano-Sasanian Kingdom in the areas of Sogdiana, Bactria and Gandhara. In the 4th century, the Guptas, an Indian dynasty also pressed from the east. The last of the Kushan and Kushano-Sasanian kingdoms were eventually overwhelmed by invaders from the north, known as the Kidarites, and then the Hepthalites.[12]",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Kushan_Empire"
        },
        "Gupta Dynasty": {
            "begin": 320,
            "end": 550,
            "desc": "descrThe Gupta Empire was an ancient Indian empire existing from the mid-to-late 3rd century CE to 543 CE. At its zenith, from approximately 319 to 543 CE, it covered much of the Indian subcontinent. This period is considered as the Golden Age of India by some historians.[note 1] The ruling dynasty of the empire was founded by the king Sri Gupta; the most notable rulers of the dynasty were Chandragupta I, Samudragupta, and Chandragupta II alias Vikramaditya. The 5th-century CE Sanskrit poet Kalidasa credits the Guptas with having conquered about twenty-one kingdoms, both in and outside India, including the kingdoms of Parasikas, the Hunas, the Kambojas, tribes located in the west and east Oxus valleys, the Kinnaras, Kiratas, and others.[non-primary source needed] The high points of this period are the great cultural developments which took place primarily during the reigns of Samudragupta, Chandragupta II and Kumaragupta I. Many of the literary sources, such as Mahabharata and Ramayana, were canonised during this period. The Gupta period produced scholars such as Kalidasa, Aryabhata, Varahamihira, and Vatsyayana who made great advancements in many academic fields.[10][11] Science and political administration reached new heights during the Gupta era.[12] The period gave rise to achievements in architecture, sculpture, and painting that \"set standards of form and taste [that] determined the whole subsequent course of art, not only in India but far beyond her borders\".[13] Strong trade ties also made the region an important cultural centre and established the region as a base that would influence nearby kingdoms and regions in Burma, Sri Lanka, and Southeast Asia.[14][unreliable source?] The Puranas, earlier long poems on a variety of subjects, are also thought to have been committed to written texts around this period.[15] The empire eventually died out because of many factors such as substantial loss of territory and imperial authority caused by their own erstwhile feudatories, as well as the invasion by the Huna peoples (Kidarites and Alchon Huns) from Central Asia.[16][17] After the collapse of the Gupta Empire in the 6th century, India was again ruled by numerous regional kingdoms.iption",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Gupta_Empire"
        },
        "Harsha's Kingdom": {
            "begin": 606,
            "end": 648,
            "desc": "Harsha (c. 590–647 CE), also known as Harshavardhana, was an Indian emperor who ruled North India from 606 to 647 CE. He was a member of the Vardhana dynasty; and was the son of Prabhakarvardhana who defeated the Alchon Huna invaders, and the younger brother of Rajyavardhana, a king of Thanesar, present-day Haryana. At the height of Harsha's power, his Empire covered much of North and Northwestern India, extended East till Kamarupa, and South until Narmada River; and eventually made Kannauj (in present Uttar Pradesh state) his capital, and ruled till 647 CE. Harsha was halted by the south Indian Emperor Pulakeshin II of the Chalukya dynasty, when Harsha tried to expand his Empire into the southern peninsula of India. The peace and prosperity that prevailed made his court a centre of cosmopolitanism, attracting scholars, artists and religious visitors from far and wide. The Chinese traveller Xuanzang visited the court of Harsha and wrote a very favourable account of him, praising his justice and generosity. His biography Harshacharita (\"Deeds of Harsha\") written by Sanskrit poet Banabhatta, describes his association with Thanesar, besides mentioning the defence wall, a moat and the palace with a two-storied Dhavalagriha (white mansion).",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Harsha"
        },
        "Chola Kingdom": {
            "begin": 850,
            "end": 1267,
            "desc": "The Chola dynasty was a Tamil dynasty of southern India, one of the longest-ruling dynasties in the world's history . The earliest datable references to the Chola are in inscriptions from the 3rd century BCE left by Ashoka, of the Maurya Empire (Ashoka Major Rock Edict No.13). As one of the Three Crowned Kings of Tamilakam, along with the Chera and Pandya, the dynasty continued to govern over varying territory until the 13th century CE. The heartland of the Cholas was the fertile valley of the Kaveri River, but they ruled a significantly larger area at the height of their power from the later half of the 9th century till the beginning of the 13th century. The whole country south of the Tungabhadra was united and held as one state for a period of three centuries and more between 907 and 1215 AD. Under Rajaraja Chola I and his successors Rajendra Chola I, Rajadhiraja Chola, Virarajendra Chola, and Kulothunga Chola I, the dynasty became a military, economic and cultural power in South Asia and South-East Asia. The power of the new empire was proclaimed to the eastern world by the expedition to the Ganges which Rajendra Chola I undertook and by naval raids on cities of the city-state of Srivijaya, as well as by the repeated embassies to China. The Chola fleet represented the zenith of ancient Indian sea power.  During the period 1010–1153, the Chola territories stretched from the islands of the Maldives in the south to as far north as the banks of the Godavari River in Andhra Pradesh. Rajaraja Chola conquered peninsular South India, annexed parts of which is now Sri Lanka and occupied the islands of the Maldives. Rajendra Chola sent a victorious expedition to North India that touched the river Ganges and defeated the Pala ruler of Pataliputra, Mahipala. He also successfully invaded cities of Srivijaya of Malaysia and Indonesia. The Chola dynasty went into decline at the beginning of the 13th century with the rise of the Pandyan dynasty, which ultimately caused their downfall.[10] The Cholas left a lasting legacy. Their patronage of Tamil literature and their zeal in the building of temples has resulted in some great works of Tamil literature and architecture. The Chola kings were avid builders and envisioned the temples in their kingdoms not only as places of worship but also as centres of economic activity.[11][12] They pioneered a centralised form of government and established a disciplined bureaucracy. The Chola school of art spread to Southeast Asia and influenced the architecture and art of Southeast Asia.[13][14]",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Chola_dynasty"
        },
        "Sultanate of Delhi": {
            "begin": 1206,
            "end": 1526,
            "desc": "The Delhi Sultanate (Persian: دهلی سلطان‎, Urdu: دہلی سلطنت‎) was an Islamic empire based in Delhi that stretched over large parts of the Indian subcontinent for 320 years (1206–1526). Five dynasties ruled over the Delhi Sultanate sequentially: the Mamluk dynasty (1206–90), the Khalji dynasty (1290–1320), the Tughlaq dynasty (1320–1414), the Sayyid dynasty (1414–51), and the Lodi dynasty (1451–1526). The sultanate is noted for being one of the few powers to repel attacks by the Mongols (from the Chagatai Khanate), causing the decline of Buddhism in East India and Bengal,[10] and enthroning one of the few female rulers in Islamic history, Razia Sultana, who reigned from 1236 to 1240.[11] Qutb al-Din Aibak, a former Turkic Mamluk slave of Muhammad Ghori was the first sultan of Delhi, and his Mamluk dynasty conquered large areas of northern India. Afterwards, the Khalji dynasty was also able to conquer most of central India, but both failed to conquer the whole of the Indian subcontinent. The sultanate reached the peak of its geographical reach during the Tughlaq dynasty, occupying most of the Indian subcontinent.[12] This was followed by decline due to Hindu reconquests, states such as the Vijayanagara Empire and Mewar asserting independence, and new Muslim sultanates such as the Bengal Sultanate breaking off. During and in the Delhi Sultanate, there was a synthesis of Indian civilization with that of Islamic civilization, and the further integration of the Indian subcontinent with a growing world system and wider international networks spanning large parts of Afro-Eurasia, which had a significant impact on Indian culture and society, as well as the wider world.[15] The time of their rule included the earliest forms of Indo-Islamic architecture,[16][17] greater use of mechanical technology,[18] increased growth rates in India's population and economy,[19] and the emergence of the Hindi-Urdu language.[20] The Delhi Sultanate was also responsible for repelling the Mongol Empire's potentially devastating invasions of India in the 13th and 14th centuries.[21] The Delhi Sultanate was also responsible for large-scale destruction and desecration of temples in the Indian subcontinent.[22] In 1526, the Sultanate was conquered and succeeded by the Mughal Empire.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Delhi_Sultanate"
        },
        "Mongolian Expansion": {
            "begin": 1206,
            "end": 1227,
            "desc": "The Mongol Empire existed during the 13th and 14th centuries, and was the largest contiguous land empire in history. Originating in Mongolia, the Mongol Empire eventually stretched from Eastern Europe and parts of Central Europe to the Sea of Japan, extending northwards into parts of Siberia; eastwards and southwards into the Indian subcontinent, Mainland Southeast Asia and the Iranian Plateau; and westwards as far as the Levant and the Carpathian Mountains.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Mongol_Empire"
        },
        "Vijayanagar": {
            "begin": 1336,
            "end": 1565,
            "desc": "The Vijayanagara Empire (also called Karnata Empire, and the Kingdom of Bisnegar by the Portuguese) was based in the Deccan Plateau region in South India. It was established in 1336 by Harihara I and his brother Bukka Raya I of Sangama Dynasty. The empire rose to prominence as a culmination of attempts by the southern powers to ward off Islamic invasions by the end of the 13th century. It lasted until 1646, although its power declined after a major military defeat in the Battle of Talikota in 1565 by the combined armies of the Deccan sultanates. The empire is named after its capital city of Vijayanagara, whose ruins surround present day Hampi, now a World Heritage Site in Karnataka, India. The writings of medieval European travelers such as Domingo Paes, Fernão Nunes, and Niccolò Da Conti, and the literature in local languages provide crucial information about its history. Archaeological excavations at Vijayanagara have revealed the empire's power and wealth. The empire's legacy includes many monuments spread over South India, the best known of which is the group at Hampi. Different temple building traditions in South and Central India came together in the Vijayanagara Architecture style. This synthesis inspired architectural innovation in Hindu temples' construction. Efficient administration and vigorous overseas trade brought new technologies such as water management systems for irrigation. The empire's patronage enabled fine arts and literature to reach new heights in Kannada, Telugu, Tamil, and Sanskrit, while Carnatic music evolved into its current form. The Vijayanagara Empire created an epoch in South Indian history that transcended regionalism by promoting Hinduism as a unifying factor.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Vijayanagara_Empire"
        },
        "Mughal Dynasty": {
            "begin": 1526,
            "end": 1858,
            "desc": "The Mughal Empire or Mogul Empire, was an early-modern empire in South Asia. For some two centuries, the empire stretched from the outer fringes of the Indus basin in the west, northern Afghanistan in the northwest, and Kashmir in the north, to the highlands of present-day Assam and Bangladesh in the east, and the uplands of the Deccan plateau in South India.[10] The Mughal empire is conventionally said to have been founded in 1526 by Babur, a warrior chieftain from what today is Uzbekistan, who employed aid from the neighboring Safavid- and Ottoman empires,[11] to defeat the Sultan of Delhi, Ibrahim Lodhi, in the First Battle of Panipat, and to sweep down the plains of Upper India. The Mughal imperial structure, however, is sometimes dated to 1600, to the rule of Babur's grandson, Akbar,[12] This imperial structure lasted until 1720, until shortly after the death of the last major emperor, Aurengzeb,[13][14] during whose reign the empire also achieved its maximum geographical extent. Reduced subsequently, especially during the East India Company rule in India, to the region in and around Old Delhi, the empire was formally dissolved by the British Raj after the Indian Rebellion of 1857. Although the Mughal empire was created and sustained by military warfare,[15][16][17] it did not vigorously suppress the cultures and peoples it came to rule, but rather equalized and placated them through new administrative practices,[18][19] and diverse ruling elites, leading to more efficient, centralised, and standardized rule.[20] The base of the empire's collective wealth was agricultural taxes, instituted by the third Mughal emperor, Akbar.[21][22] These taxes, which amounted to well over half the output of a peasant cultivator,[23] were paid in the well-regulated silver currency,[20] and caused peasants and artisans to enter larger markets.[24] The relative peace maintained by the empire during much of the 17th century was a factor in India's economic expansion.[25] Burgeoning European presence in the Indian Ocean, and its increasing demand for Indian raw- and finished products, created still greater wealth in the Mughal courts.[26] There was more conspicuous consumption among the Mughal elite,[27] resulting in greater patronage of painting, literary forms, textiles, and architecture, especially during the reign of Shah Jahan.[28] Among the Mughal UNESCO World Heritage Sites in South Asia are: Agra Fort, Fatehpur Sikri, Red Fort, Humayun's Tomb, Lahore Fort and the Taj Mahal, which is described as, \"The jewel of Muslim art in India, and one of the universally admired masterpieces of the world's heritage.\"[29]",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Mughal_Empire"
        },
        "British Rule": {
            "begin": 1858,
            "end": 1947,
            "desc": "The East India Company, was an English and later British joint-stock company. It was formed to trade in the Indian Ocean region, initially with Mughal India and the East Indies, and later with Qing China. The company ended up seizing control of large parts of the Indian subcontinent, colonised parts of Southeast Asia, and colonised Hong Kong after a war with Qing China. After the first war for Indian independence, the British Government took over the administration to establish the British Raj. The British Raj refers to the period of British rule on the Indian subcontinent between 1858 and 1947. The system of governance was instituted in 1858 when the rule of the East India Company was transferred to the Crown in the person of Queen Victoria (who in 1876 was proclaimed Empress of India). It lasted until 1947, when the British provinces of India were partitioned into two sovereign dominion states: the Dominion of India and the Dominion of Pakistan, leaving the princely states to choose between them. The two new dominions later became the Republic of India and the Islamic Republic of Pakistan (the eastern half of which, still later, became the People's Republic of Bangladesh). The province of Burma in the eastern region of the Indian Empire had been made a separate colony in 1937 and became independent in 1948.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/History_of_the_British_Raj"
        },
        "India": {
            "begin": 1957,
            "end": 1990,
            "desc": "The history of the Republic of India begins on 26 January 1950. The country became an independent nation within the British Commonwealth on 15 August 1947. Concurrently the Muslim-majority northwest and east of British India was separated into the Dominion of Pakistan, by the partition of India. The partition led to a population transfer of more than 10 million people between India and Pakistan and the death of about one million people. Indian National Congress leader Jawaharlal Nehru became the first Prime Minister of India, but the leader most associated with the independence struggle, Mahatma Gandhi, accepted no office. Constitution adopted in 1950 made India  a democratic country what has been sustained since then. India's sustained democratic freedoms are unique among world's newly independent states. The nation faced religious violence, casteism, naxalism, terrorism and regional separatist insurgencies. India has unresolved territorial disputes with China which in 1962 escalated into the Sino-Indian War, and with Pakistan which resulted in wars in 1947, 1965, 1971 and 1999. India was neutral in the Cold War, and a leader in the Non-Aligned Movement.  It had a brief era of alliance with former Soviet Union, when Pakistan was closely allied to the United States and People's Republic of China. India is a nuclear-weapon state, having conducted its first nuclear test in 1974, followed by another five tests in 1998. From the 1950s to the 1980s, India followed socialist-inspired policies. The economy was influenced by extensive regulation, protectionism and public ownership, leading to pervasive corruption and slow economic growth. Beginning in 1991, neoliberal economic reforms have transformed India into the third largest and one of the fastest-growing economies in the world, though it. From being a relatively destitute country in its formative years, Indian Republic has emerged as a fast growing G20 major economy with high military spending. and is seeking a permanent seat in the United Nations Security Council. India sometimes been referred as a great power and a potential superpower given its large and growing economy, military and population.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/History_of_the_Republic_of_India"
        }
    },

    "north-america": {
        "Chinook Society": {
            "begin": -3000,
            "end": -1850,
            "desc": "Chinookan peoples include several groups of indigenous people of the Pacific Northwest in the United States who speak the Chinookan languages. Chinookan-speaking peoples reside along the Lower and Middle Columbia River (Wimahl) (″Big River″) from the river's gorge (near the present town of The Dalles, Oregon) downstream (west) to the river's mouth, and along adjacent portions of the coasts, from Tillamook Head of present-day Oregon in the south, north to Willapa Bay in southwest Washington. In 1805 the Lewis and Clark Expedition encountered the Chinook Tribe on the lower Columbia. There are several theories about where the name ″Chinook″ came from. Some say it is a Chehalis word Tsinúk for the inhabitants of and a particular village site on Baker Bay, or \"Fish Eaters\". It may also be a word meaning \"strong fighters\".",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Chinookan_peoples"
        },
        "Olmec Society": {
            "begin": -1200,
            "end": 100,
            "desc": "The Olmecs (/ˈɒlmɛks, ˈoʊl-/) were the earliest known major civilization in Mesoamerica following a progressive development in Soconusco. They lived in the tropical lowlands of south-central Mexico, in the present-day states of Veracruz and Tabasco. It has been speculated that the Olmecs derive in part from neighboring Mokaya or Mixe–Zoque. The Olmecs flourished during Mesoamerica's formative period, dating roughly from as early as 1500 BCE to about 400 BCE. Pre-Olmec cultures had flourished since about 2500 BCE, but by 1600–1500 BCE, early Olmec culture had emerged, centered on the San Lorenzo Tenochtitlán site near the coast in southeast Veracruz. They were the first Mesoamerican civilization, and laid many of the foundations for the civilizations that followed. Among other \"firsts\", the Olmec appeared to practice ritual bloodletting and played the Mesoamerican ballgame, hallmarks of nearly all subsequent Mesoamerican societies. The aspect of the Olmecs most familiar now is their artwork, particularly the aptly named \"colossal heads\". The Olmec civilization was first defined through artifacts which collectors purchased on the pre-Columbian art market in the late 19th century and early 20th century. Olmec artworks are considered among ancient America's most striking.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Olmecs"
        },
        "Mayan Society": {
            "begin": 300,
            "end": 1100,
            "desc": "The Maya civilization was a Mesoamerican civilization developed by the Maya peoples, and noted for its logosyllabic script—the most sophisticated and highly developed writing system in pre-Columbian Americas—as well as for its art, architecture, mathematics, calendar, and astronomical system. The Maya civilization developed in an area that encompasses southeastern Mexico, all of Guatemala and Belize, and the western portions of Honduras and El Salvador. This region consists of the northern lowlands encompassing the Yucatán Peninsula, and the highlands of the Sierra Madre, running from the Mexican state of Chiapas, across southern Guatemala and onwards into El Salvador, and the southern lowlands of the Pacific littoral plain. The overarching term \"Maya\" is a modern collective term that refers to the peoples of the region, however, the term was not used by the indigenous populations themselves since there never was a common sense of identity or political unity among the distinct populations. The Archaic period, prior to 2000 BC, saw the first developments in agriculture and the earliest villages. The Preclassic period (c. 2000 BC to 250 AD) saw the establishment of the first complex societies in the Maya region, and the cultivation of the staple crops of the Maya diet, including maize, beans, squashes, and chili peppers. The first Maya cities developed around 750 BC, and by 500 BC these cities possessed monumental architecture, including large temples with elaborate stucco façades. Hieroglyphic writing was being used in the Maya region by the 3rd century BC. In the Late Preclassic a number of large cities developed in the Petén Basin, and the city of Kaminaljuyu rose to prominence in the Guatemalan Highlands. Beginning around 250 AD, the Classic period is largely defined as when the Maya were raising sculpted monuments with Long Count dates. This period saw the Maya civilization develop many city-states linked by a complex trade network. In the Maya Lowlands two great rivals, the cities of Tikal and Calakmul, became powerful. The Classic period also saw the intrusive intervention of the central Mexican city of Teotihuacan in Maya dynastic politics. In the 9th century, there was a widespread political collapse in the central Maya region, resulting in internecine warfare, the abandonment of cities, and a northward shift of population. The Postclassic period saw the rise of Chichen Itza in the north, and the expansion of the aggressive Kʼicheʼ kingdom in the Guatemalan Highlands. In the 16th century, the Spanish Empire colonised the Mesoamerican region, and a lengthy series of campaigns saw the fall of Nojpetén, the last Maya city, in 1697.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Maya_civilization"
        },
        "Toltec Society": {
            "begin": 900,
            "end": 1175,
            "desc": "The Toltec culture is an archaeological Mesoamerican culture that dominated a state centered in Tula, Hidalgo, Mexico in the early post-classic period of Mesoamerican chronology (ca. 900–1168 CE). The later Aztec culture saw the Toltecs as their intellectual and cultural predecessors and described Toltec culture emanating from Tōllān [ˈtoːlːaːn] (Nahuatl for Tula) as the epitome of civilization; in the Nahuatl language the word Tōltēcatl [toːlˈteːkat͡ɬ] (singular) or Tōltēcah [toːlˈteːkaʔ] (plural) came to take on the meaning \"artisan\". The Aztec oral and pictographic tradition also described the history of the Toltec Empire, giving lists of rulers and their exploits. Modern scholars debate whether the Aztec narratives of Toltec history should be given credence as descriptions of actual historical events. While all scholars acknowledge that there is a large mythological part of the narrative, some maintain that by using a critical comparative method some level of historicity can be salvaged from the sources. Others maintain that continued analysis of the narratives as sources of actual history is futile and hinders access to actual knowledge of the culture of Tula de Allende.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Toltec"
        },
        "Aztec Empire": {
            "begin": 1345,
            "end": 1520,
            "desc": "The Aztec Empire, or the Triple Alliance (Classical Nahuatl: Ēxcān Tlahtōlōyān, [ˈjéːʃkaːn̥ t͡ɬaʔtoːˈlóːjaːn̥]), was an alliance of three Nahua altepetl city/states: Mexico-Tenochtitlan, Texcoco, and Tlacopan. These three city-states ruled the area in and around the Valley of Mexico from 1428 until the combined forces of the Spanish conquistadores and their native allies under Hernán Cortés defeated them in 1521. The Triple Alliance was formed from the victorious factions of a civil war fought between the city of Azcapotzalco and its former tributary provinces. Despite the initial conception of the empire as an alliance of three self-governed city-states, Tenochtitlan quickly became dominant militarily. By the time the Spanish arrived in 1519, the lands of the Alliance were effectively ruled from Tenochtitlan, while the other partners in the alliance had taken subsidiary roles. The alliance waged wars of conquest and expanded rapidly after its formation. At its height, the alliance controlled most of central Mexico as well as some more distant territories within Mesoamerica, such as the Xoconochco province, an Aztec exclave near the present-day Guatemalan border. Aztec rule has been described by scholars as \"hegemonic\" or \"indirect\". The Aztecs left rulers of conquered cities in power so long as they agreed to pay semi-annual tribute to the Alliance, as well as supply military forces when needed for the Aztec war efforts. In return, the imperial authority offered protection and political stability, and facilitated an integrated economic network of diverse lands and peoples who had significant local autonomy. The state religion of the empire was polytheistic, worshiping a diverse pantheon that included dozens of deities. Many had officially recognized cults large enough so that the deity was represented in the central temple precinct of the capital Tenochtitlan. The imperial cult, specifically, was that of Huitzilopochtli, the distinctive warlike patron god of the Mexica. Peoples in conquered provinces were allowed to retain and freely continue their own religious traditions, so long as they added the imperial god Huitzilopochtli to their local pantheons.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Aztec_Empire"
        },
        "Colonial Rule": {
            "begin": 1520,
            "end": 1776,
            "desc": "The European colonization of the Americas describes the history of the settlement and establishment of control of the continents of the Americas by most of the naval powers of Western Europe.  American Discovery Viewed by Native Americans (Thomas Hart Benton, 1922). European \"discovery\" and colonization would have disastrous effects on the indigenous peoples of the Americas and their societies. Systematic European colonization began in 1492, when a Spanish expedition headed by the Italian explorer Christopher Columbus sailed west to find a new trade route to the Far East but inadvertently landed in what came to be known to Europeans as the \"New World\". He ran aground on 5 December 1492 on the northern part of Hispaniola, which the Taino people had inhabited since the 9th century; the site became the first permanent European settlement in the Americas. Western European conquest, large-scale exploration and colonization soon followed. Columbus's first two voyages (1492–93) reached the Bahamas and various Caribbean islands, including Hispaniola, Puerto Rico, and Cuba. In 1497, Italian explorer John Cabot, on behalf of England, landed on the North American coast, and a year later, Columbus's third voyage reached the South American coast. As the sponsor of Christopher Columbus's voyages, Spain was the first European power to settle and colonize the largest areas, from North America and the Caribbean to the southern tip of South America. The Spaniards began building their empire of the Americas in the Caribbean, using islands such as Cuba, Puerto Rico, and Hispaniola as bases. The North and South American mainland fell to the conquistadors precipitating an estimated 8,000,000 deaths of indigenous populations primarily through the spread of Afro-Eurasian diseases. Some authors have argued this demographic collapse to be the first large-scale act of genocide in the modern era. Florida fell to Juan Ponce de León after 1513. From 1519 to 1521, Hernán Cortés waged a campaign against the Aztec Empire, ruled by Moctezuma II. The Aztec capital, Tenochtitlan, became Mexico City, the chief city of what the Spanish were now calling \"New Spain\". More than 240,000 Aztecs died during the siege of Tenochtitlan. Of these, 100,000 died in combat. Between 500 and 1,000 of the Spaniards engaged in the conquest died. Later, the areas that are today California, Arizona, New Mexico, Colorado, Texas, Missouri, Louisiana, and Alabama were taken over by other conquistadors, such as Hernando de Soto, Francisco Vázquez de Coronado, and Álvar Núñez Cabeza de Vaca. Farther to the south, Francisco Pizarro conquered the Inca Empire during the 1530s. The de Soto expedition was the first major encounter of Europeans with North American Indians in the eastern half of the United States. The expedition journeyed from Florida through present-day Georgia and the Carolinas, then west across the Mississippi and into Texas. De Soto fought his biggest battle at the walled town of Mabila in present-day Alabama on October 18, 1540. Spanish losses were 22 killed and 148 wounded. The Spaniards claimed that 2,500 Indians died. If true, Mabila was the bloodiest battle ever fought between Native Americans and Europeans in the present-day United States. The centuries of continuous conflicts between the North American Indians and the Anglo-Americans were secondary to the devastation wrought on the densely populated Meso-American, Andean, and Caribbean heartlands. The British colonization of the Americas started with the unsuccessful settlement attempts in Roanoke and Newfoundland. The English eventually went on to control much of Eastern North America, the Caribbean, and parts of South America. The British also gained Florida and Quebec in the French and Indian War. Other powers such as France also founded colonies in the Americas: in eastern North America, a number of Caribbean islands and small coastal parts of South America. Portugal colonized Brazil, tried colonizing the eastern coasts of present-day Canada and settled for extended periods northwest (on the east bank) of the River Plate. The Age of Exploration was the beginning of territorial expansion for several European countries. Europe had been preoccupied with internal wars and was slowly recovering from the loss of population caused by the Black Death; thus the rapid rate at which it grew in wealth and power was unforeseeable in the early 15th century. Eventually, most of the Western Hemisphere came under the control of Western European governments, leading to changes to its landscape, population, and plant and animal life. In the 19th century over 50 million people left Western Europe for the Americas. The post-1492 era is known as the period of the Columbian Exchange, a dramatically widespread exchange of animals, plants, culture, human populations (including slaves), ideas, and communicable disease between the North and South American and Afro-Eurasian hemispheres following Columbus's voyages to the Americas.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/European_colonization_of_the_Americas"
        },
        "United States": {
            "begin": 1776,
            "end": 1990,
            "desc": "The United States of America (USA), commonly known as the United States (U.S. or US), the States or simply America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At 3.8 million square miles (9.8 million km2), it is the world's third or fourth-largest country by total area and is slightly smaller than the entire continent of Europe. Most of the country is located in central North America between Canada and Mexico. With an estimated population of over 327 million people, the U.S. is the third most populous country. The capital is Washington, D.C., and the most populous city is New York City. Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago.[21] European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Numerous disputes between Great Britain and the colonies led to the American Revolutionary War lasting between 1775 and 1783, leading to independence.[22] The United States embarked on a vigorous expansion across North America throughout the 19th century—gradually acquiring new territories,[23] displacing Native Americans, and admitting new states—until by 1848 it spanned the continent.[23] During the second half of the 19th century, the American Civil War led to the abolition of slavery in the United States.[24][25] The Spanish–American War and World War I confirmed the country's status as a global military power. The United States emerged from World War II as a global superpower. It was the first country to develop nuclear weapons, and the only one to use them in warfare. During the Cold War, the United States and the Soviet Union competed in the Space Race, culminating with the 1969 Apollo 11 mission, the spaceflight that first landed humans on the Moon. The end of the Cold War and collapse of the Soviet Union in 1991 left the United States as the world's sole superpower.[26]",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/United_States"
        },
        "Revolutions": {
            "begin": 1791,
            "end": 1825,
            "desc": "Decolonization of the Americas refers to the process by which the countries in the Americas gained their independence from European rule. The American Revolution was the first in the Americas, and the British defeat in the American Revolutionary War (1775–1783) was a surprising victory against a great power. The French Revolution in Europe followed, and collectively these events had profound effects on the British, Spanish, Portuguese, and French colonies in the Americas. A revolutionary wave followed, resulting in the creation of a number of independent countries in Latin America. The Haitian Revolution lasted from 1791 to 1804 and resulted in the independence of the French slave colony. The Peninsular War with France, which resulted from the Napoleonic occupation of Spain, caused Spanish Creoles in Spanish America to question their allegiance to Spain, stoking independence movements that culminated in various Spanish American wars of independence, which lasted almost two decades. At the same time, the Portuguese monarchy relocated to Brazil during Portugal's French occupation. After the royal court returned to Lisbon, the prince regent, Pedro, remained in Brazil and in 1822 successfully declared himself emperor of a newly independent Brazil. Though the Russians also operated forts in California and Hawaii, the bulk of Russian America was sold to the United States in 1867 and became Alaska. Spain would lose all three of its remaining Caribbean colonies by the end of the 1800s. Santo Domingo declared independence in 1821 as the Republic of Spanish Haiti. After unification and then split from the former French colony of Haiti, the President of the Dominican Republic signed an agreement that revert the country to a Spanish colony in 1861. This triggered the Dominican Restoration War, which resulted in the Dominican Republic's second independence from Spain in 1865. Cuba fought for independence from Spain in the Ten Years' War (1868–1878) and Little War (1879-1880) and finally the Cuban War of Independence (1895–98). American intervention in 1898 became the Spanish–American War and resulted in the United States gaining Puerto Rico (which is still a U.S. territory), Guam and the Philippine Islands in the Pacific Ocean. Under military occupation, Cuba became a U.S. protectorate until its dependence in 1902.<br><br>Peaceful independence by voluntary withdrawal of colonial powers then became the norm in the second half of the 20th century. However, there are still many British and Dutch colonies in North America (mostly Caribbean islands), and France has fully integrated most of its former colonies as fully constituent departments of France.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Decolonization_of_the_Americas"
        },
        "Free States": {
            "begin": 1825,
            "end": 1990,
            "desc": "The Americas are home to over a billion inhabitants, two-thirds of whom reside in the United States, Brazil, and Mexico. It is home to eight megacities (metropolitan areas with ten million inhabitants or more): New York City (23.9 million), Mexico City (21.2 million), São Paulo (21.2 million), Los Angeles (18.8 million), Buenos Aires (15.6 million),[10] Rio de Janeiro (13.0 million), Bogotá (10.4 million), and Lima (10.1 million).",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/Americas"
        }
    },

    "south-america": {
        "Incan State": {
            "begin": 1250,
            "end": 1572,
            "desc": "The Inca Empire (Quechua: Tawantinsuyu, lit. \"The Four Regions\"), also known as the Incan Empire and the Inka Empire, was the largest empire in pre-Columbian America. Its political and administrative structure is considered by most scholars to have been the most developed in the Americas before Columbus' arrival. The administrative, political and military center of the empire was located in the city of Cusco. The Inca civilization arose from the Peruvian highlands sometime in the early 13th century. Its last stronghold was conquered by the Spanish in 1572.<br><br>From 1438 to 1533, the Incas incorporated a large portion of western South America, centered on the Andean Mountains, using conquest and peaceful assimilation, among other methods. At its largest, the empire joined Peru, southwest Ecuador, western and south central Bolivia, northwest Argentina, a large portion of what is today Chile, and a small part of southwest Colombia into a state comparable to the historical empires of Eurasia. Its official language was Quechua. Many local forms of worship persisted in the empire, most of them concerning local sacred Huacas, but the Inca leadership encouraged the sun worship of Inti – their sun god – and imposed its sovereignty above other cults such as that of Pachamama. The Incas considered their king, the Sapa Inca, to be the \"son of the sun.\"<br><br>Notable features of the Inca Empire include its monumental architecture, especially stonework, extensive road network reaching all corners of the empire, finely-woven textiles, use of knotted strings (quipu) for record keeping and communication, agricultural innovations in a difficult environment, and the organization and management fostered or imposed on its people and their labor.",
            "side": 1,
            "link": "https://en.wikipedia.org/wiki/Inca_Empire"
        },
        "Colonial Rule": {
            "begin": 1520,
            "end": 1791,
            "desc": "The European colonization of the Americas describes the history of the settlement and establishment of control of the continents of the Americas by most of the naval powers of Western Europe.  American Discovery Viewed by Native Americans (Thomas Hart Benton, 1922). European \"discovery\" and colonization would have disastrous effects on the indigenous peoples of the Americas and their societies. Systematic European colonization began in 1492, when a Spanish expedition headed by the Italian explorer Christopher Columbus sailed west to find a new trade route to the Far East but inadvertently landed in what came to be known to Europeans as the \"New World\". He ran aground on 5 December 1492 on the northern part of Hispaniola, which the Taino people had inhabited since the 9th century; the site became the first permanent European settlement in the Americas. Western European conquest, large-scale exploration and colonization soon followed. Columbus's first two voyages (1492–93) reached the Bahamas and various Caribbean islands, including Hispaniola, Puerto Rico, and Cuba. In 1497, Italian explorer John Cabot, on behalf of England, landed on the North American coast, and a year later, Columbus's third voyage reached the South American coast. As the sponsor of Christopher Columbus's voyages, Spain was the first European power to settle and colonize the largest areas, from North America and the Caribbean to the southern tip of South America. The Spaniards began building their empire of the Americas in the Caribbean, using islands such as Cuba, Puerto Rico, and Hispaniola as bases. The North and South American mainland fell to the conquistadors precipitating an estimated 8,000,000 deaths of indigenous populations primarily through the spread of Afro-Eurasian diseases. Some authors have argued this demographic collapse to be the first large-scale act of genocide in the modern era. Florida fell to Juan Ponce de León after 1513. From 1519 to 1521, Hernán Cortés waged a campaign against the Aztec Empire, ruled by Moctezuma II. The Aztec capital, Tenochtitlan, became Mexico City, the chief city of what the Spanish were now calling \"New Spain\". More than 240,000 Aztecs died during the siege of Tenochtitlan. Of these, 100,000 died in combat. Between 500 and 1,000 of the Spaniards engaged in the conquest died. Later, the areas that are today California, Arizona, New Mexico, Colorado, Texas, Missouri, Louisiana, and Alabama were taken over by other conquistadors, such as Hernando de Soto, Francisco Vázquez de Coronado, and Álvar Núñez Cabeza de Vaca. Farther to the south, Francisco Pizarro conquered the Inca Empire during the 1530s. The de Soto expedition was the first major encounter of Europeans with North American Indians in the eastern half of the United States. The expedition journeyed from Florida through present-day Georgia and the Carolinas, then west across the Mississippi and into Texas. De Soto fought his biggest battle at the walled town of Mabila in present-day Alabama on October 18, 1540. Spanish losses were 22 killed and 148 wounded. The Spaniards claimed that 2,500 Indians died. If true, Mabila was the bloodiest battle ever fought between Native Americans and Europeans in the present-day United States. The centuries of continuous conflicts between the North American Indians and the Anglo-Americans were secondary to the devastation wrought on the densely populated Meso-American, Andean, and Caribbean heartlands. The British colonization of the Americas started with the unsuccessful settlement attempts in Roanoke and Newfoundland. The English eventually went on to control much of Eastern North America, the Caribbean, and parts of South America. The British also gained Florida and Quebec in the French and Indian War. Other powers such as France also founded colonies in the Americas: in eastern North America, a number of Caribbean islands and small coastal parts of South America. Portugal colonized Brazil, tried colonizing the eastern coasts of present-day Canada and settled for extended periods northwest (on the east bank) of the River Plate. The Age of Exploration was the beginning of territorial expansion for several European countries. Europe had been preoccupied with internal wars and was slowly recovering from the loss of population caused by the Black Death; thus the rapid rate at which it grew in wealth and power was unforeseeable in the early 15th century. Eventually, most of the Western Hemisphere came under the control of Western European governments, leading to changes to its landscape, population, and plant and animal life. In the 19th century over 50 million people left Western Europe for the Americas. The post-1492 era is known as the period of the Columbian Exchange, a dramatically widespread exchange of animals, plants, culture, human populations (including slaves), ideas, and communicable disease between the North and South American and Afro-Eurasian hemispheres following Columbus's voyages to the Americas.",
            "side": 2,
            "link": "https://en.wikipedia.org/wiki/European_colonization_of_the_Americas"
        },
        "Revolutions": {
            "begin": 1791,
            "end": 1825,
            "desc": "Decolonization of the Americas refers to the process by which the countries in the Americas gained their independence from European rule. The American Revolution was the first in the Americas, and the British defeat in the American Revolutionary War (1775–1783) was a surprising victory against a great power. The French Revolution in Europe followed, and collectively these events had profound effects on the British, Spanish, Portuguese, and French colonies in the Americas. A revolutionary wave followed, resulting in the creation of a number of independent countries in Latin America. The Haitian Revolution lasted from 1791 to 1804 and resulted in the independence of the French slave colony. The Peninsular War with France, which resulted from the Napoleonic occupation of Spain, caused Spanish Creoles in Spanish America to question their allegiance to Spain, stoking independence movements that culminated in various Spanish American wars of independence, which lasted almost two decades. At the same time, the Portuguese monarchy relocated to Brazil during Portugal's French occupation. After the royal court returned to Lisbon, the prince regent, Pedro, remained in Brazil and in 1822 successfully declared himself emperor of a newly independent Brazil. Though the Russians also operated forts in California and Hawaii, the bulk of Russian America was sold to the United States in 1867 and became Alaska. Spain would lose all three of its remaining Caribbean colonies by the end of the 1800s. Santo Domingo declared independence in 1821 as the Republic of Spanish Haiti. After unification and then split from the former French colony of Haiti, the President of the Dominican Republic signed an agreement that revert the country to a Spanish colony in 1861. This triggered the Dominican Restoration War, which resulted in the Dominican Republic's second independence from Spain in 1865. Cuba fought for independence from Spain in the Ten Years' War (1868–1878) and Little War (1879-1880) and finally the Cuban War of Independence (1895–98). American intervention in 1898 became the Spanish–American War and resulted in the United States gaining Puerto Rico (which is still a U.S. territory), Guam and the Philippine Islands in the Pacific Ocean. Under military occupation, Cuba became a U.S. protectorate until its dependence in 1902.<br><br>Peaceful independence by voluntary withdrawal of colonial powers then became the norm in the second half of the 20th century. However, there are still many British and Dutch colonies in North America (mostly Caribbean islands), and France has fully integrated most of its former colonies as fully constituent departments of France.",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Decolonization_of_the_Americas"
        },
        "Free States": {
            "begin": 1825,
            "end": 1990,
            "desc": "The Americas are home to over a billion inhabitants, two-thirds of whom reside in the United States, Brazil, and Mexico. It is home to eight megacities (metropolitan areas with ten million inhabitants or more): New York City (23.9 million), Mexico City (21.2 million), São Paulo (21.2 million), Los Angeles (18.8 million), Buenos Aires (15.6 million),[10] Rio de Janeiro (13.0 million), Bogotá (10.4 million), and Lima (10.1 million).",
            "side": 0,
            "link": "https://en.wikipedia.org/wiki/Americas"
        }
    },

    "oceania": {
    }
}